[
    {
        "id": 1,
        "title": "The Carousel of Love",
        "introduction": "The urinal, known by many names and designated as a Norwegian Cultural Heritage Site for its simple and functional design, stands as a testament to old gay history in Norway.",
        "description": "<p>There is a Norwegian saying that can be translated to “A dear child has many names.” The same applies to this 1937 urinal, referred to not only as “the Carousel of Love” (or Kjærlighetskarusellen in Norwegian) but also as 'the Wheel of Fortune,' 'the Round Barrel,' 'the Mushroom,' and 'the Umbrella.' This variety in names reflects its role as a gathering place for homosexual men during a time when homosexuality was socially unacceptable and illegal in Norway.</p><p>The Carousel of Love served as an important meeting place for gay men during a time when homosexuality was taboo in Norway, and sex between men was illegal until 1972.</p><p>In 2009, the urinal was declared a Norwegian Cultural Heritage Site, aimed at highlighting the diversity and importance of Norway’s cultural heritage for all sectors of the community. Located in Stensparken in Oslo, the functionalist urinal is perhaps the most iconic example of queer architecture in Norway. Designed by Oslo’s city architect Harald Aars and completed in 1937, it was intended to fulfill hygienic and practical considerations while also serving as a sculptural element in the park. In connection with the Queer Culture Year in 2022, artist Per Barclay initiated the restoration of the urinal and the installation of lighting.</p>",
        "where": "You can find the Carousel of Love in Stensparken in Oslo, next to Fagerborg Church.",
        "address": "Sporveisgata, 0354 Oslo",
        "category": "monument",
        "image": "images/thecarouseloflove/thecarouseloflove01.jpg",
        "galleryPath": "images/thecarouseloflove",
        "galleryImages": ["thecarouseloflove01.jpg", "thecarouseloflove02.jpg", "thecarouseloflove03.jpg", "thecarouseloflove04.jpg"],
        "tags": ["local history", "design"],
        "latitude": 59.926962,
        "longitude": 10.729680,
        "favorite": true
    },
    {
        "id": 2,
        "title": "The Devil of Oslo",
        "introduction": "In downtown Oslo, a menacing and terrifying relief clings to a church wall only known as The Devil of Oslo.",
        "description": "<p>The Devil of Oslo is a favorite stop for tourist guides. After showing their group the statue of king Karl Johan, the citys founding father, they dicrect the group to the closest corner of The Cathedral where the 'Oslo-devil' is found.</p><p>The Oslo Cathedral was consecrated in 1697 and is one of the most famous churches in Norway. The Devil of Oslo, however, is much older. The devil is about 900-years-old and was found among the ruins of St. Hallvard’s Cathedral. The statue was removed from the ruins and grumbled onto the walls of the Oslo Cathedral. The figure depicts a man being attacked on both sides by a dragon and a lion.</p>",
        "where": "The Devil of Oslo can be found on the outside of Oslo Cathedral, just right of the main entrance. Look for the first corner facing the statue of King Christian the 4th.",
        "address": "Karl Johans gt. 11, 0154 Oslo",
        "category": "monument",
        "image": "images/thedevilofoslo/thedevilofoslo01.jpg",
        "galleryPath": "images/thedevilofoslo",
        "galleryImages": ["thedevilofoslo01.jpg", "thedevilofoslo02.jpg", "thedevilofoslo03.jpg", "thedevilofoslo04.jpg"],
        "tags": ["local history", "religion"],
        "latitude": 59.912626,
        "longitude": 10.746361,
        "favorite": true
    },
    {
        "id": 3,
        "title": "Syverkiosken",
        "introduction": "The only remaining hot dog kiosk in Oslo still lives strongly, and still offers the best hot dogs Oslo has to offer. The tiny wooden kiosk has become world famous after being in several TV shows, newspapers, songs, and books.",
        "description": "<p>In the old days, Oslo was full of hot dog stands, and I’m not talking about Narvesen and Deli De Luca, but proper hot dog stands that focused solely on sausages. At one time, Oslo had over a hundred of these. Today, only one remains, and it’s called Syverkiosken. Here you’ll meet the talkative and friendly Erlend, who took over the stand from his father, who bought it way back in 1971 when it was called «Joss sin». However, the hot dog stand is much older than that. So old that no one really knows when it started. Some say the 1950s, while other sources suggest 1937 as the starting point. Erlend runs the stand every day all year round, only taking Christmas Eve off. This guy knows how to chat—so expect to have a little conversation thrown in with your purchase.</p><p>In the twelve-square-meter stand, Erlend runs the show, serving only one type of wienerpølse that is specially made for Syverkiosken and available nowhere else. Everything else is homemade too, including the ketchup and mashed potatoes. Syverkiosken has gained international recognition, and the British newspaper The Guardian featured an article about the stand titled 'Hotdog Heaven on the Streets of Oslo.' It was also featured on the travel TV series «Travel Man», with Richard Ayoade from «The IT Crowd», where they praised the sausages as some of the best they’d ever tasted.</p><p>The hot dog stand is even mentioned in the Lillebjørn Nilsen song «Alexander Kiellands Plass» with the line: 'Og ved Joss sin pølsebu sa hun: 'Kanskje vi ses igjen?'' Additionally, Mulegutten from the book «Altmuligmannen en internasjonal storpolitisk thriller» is a regular customer at the stand. Apparently, Rolv Wesenlund was too. So, you’re in good company here!</p>",
        "where": "Syverkiosen is at Alexander Kjellands Plass. Look for the grafitti with the Dalton Brothers.",
        "address": "Maridalsveien 45B, 0175 Oslo",
        "category": "restaurant",
        "image": "images/syverkiosken/syverkiosken01.jpg",
        "galleryPath": "images/syverkiosken",
        "galleryImages": ["syverkiosken01.jpg", "syverkiosken02.jpg", "syverkiosken03.jpg", "syverkiosken04.jpg", "syverkiosken05.jpg"],
        "tags": ["local history", "food", "restaurant"],
        "latitude": 59.928266,
        "longitude": 10.752394,
        "favorite": true
    },
    {
        "id": 4,
        "title": "James Caan's Favorite Burger: Valkyrien Grill",
        "introduction": "Famous Hollywood actor James Caan, wll-known as Sonny Corleone in The Godfather, has a favorite burger and it is in Oslo. The movie 'North Star' was shot in Norway in 1996 and James Caan needed is burger every day from this small burger joint called Valkyrien Grill.",
        "description": "<p>At Valkyries Plass, near Majorstuen, we find the closed-down subway station Valkyrie Plass Station. It was shut down in 1985 because it was so close to Majorstuen subway station. A Narvesen kiosk was built where the entrance used to be, which later turned into a fast-food joint that still stands today, called Valkyrien Grill. Part of the filming for the fantastic TV series “Valkyrien” took place in the fast-food joint, and the staircase down to the station can be found through a side door by the entrance. Cool in itself, but let’s go back to 1996, during the filming of the movie “North Star,” also known as “Tashunga.” James Caan, perhaps best known as Sonny in “The Godfather,” had the leading role. The movie is set in Alaska but was filmed in Maridalen in Oslo.</p><p>James Caan, being a true American, wanted the best burger in town and was tipped off about Valkyrien Grill. He jumped into his limousine, which took him to Majorstuen. He liked it so much that he came every day during the filming of the movie. He simply couldn’t get enough of the juicy burger at Valkyrien Grill. Note that it's the tenderloin burger that’s the star. Filming eventually ended, and things went back to normal. That was until an interview with James Caan appeared in an American newspaper about where to find the best food, and yes, it was, of course, the burger at Valkyrien Grill in Oslo! “In the capital of Norway!” he said. A Norwegian exchange student had read the interview and made sure to send it over to Valkyrien Grill, which they proudly displayed. Well deserved—because the burger is good—very good!</p>",
        "where": "Valkyrien Grill is at the start of the park Valkyrians plass. The old station house is now used for the burger joint",
        "address": "Bogstadveien 71B, 0366 Oslo",
        "category": "restaurant",
        "image": "images/valkyriengrill/valkyriengrill01.jpg",
        "galleryPath": "images/valkyriengrill",
        "galleryImages": ["valkyriengrill01.jpg", "valkyriengrill02.jpg", "valkyriengrill03.jpg", "valkyriengrill04.jpg", "valkyriengrill05.jpg", "valkyriengrill06.jpg", "valkyriengrill07.jpg"],
        "tags": ["local history", "food", "restaurant"],
        "latitude": 59.928139,
        "longitude": 10.718283,
        "favorite": true
    },
    {
        "id": 5,
        "title": "Engebret Café",
        "introduction": "Do you want to eat where all the most famous Norwegian's used to eat? You can do it at Norway's oldest restaurant.",
        "description": "<p>Engebret is Norway's oldest restaurant still in operation, having opened back in 1857. Originally located at Rådhusgata 11, Engebret moved just a few years later, in 1863, to Bankplassen, where it remains today. Little has changed in the café since then. Many of Norway's great artists and writers of the past had regular tables here, including Ibsen, Grieg, Bjørnstjerne Bjørnson, Hamsun, Edvard Munch, Johanne Dybwad, Sigrid Undset, Peter Christen Asbjørnsen, Johan Sverdrup, and many more. Some of these have plaques at the tables indicating which ones were their regular spots. Edvard Munch, known for his heavy drinking, was even thrown out of the restaurant after a drunken spree, which led him to resign from the Oslo Art Association. The letter of his resignation is actually displayed at the entrance of Engebret.</p><p>Another amusing story involves regular guest Bjørnstjerne Bjørnson, who jokingly asked a nervous young waiter if he had hemorrhoids because he was so restless. The waiter ran to the kitchen to check if they had hemorrhoids on the menu but returned embarrassed when he learned what they were. This backfired on Bjørnson when he later ordered artichokes; the waiter just laughed and said he wouldn’t fall for that again. Former Prime Minister Johan Sverdrup once forgot to pay his bill of 2.90 kroner in 1884. Lars Sponheim settled that bill on May 21, 2008.</p><p>Many TV series and films have taken place at Engebret Café. Most famously, the show 'Husker du' with Odd Gryte ran for fourteen years. In the 1967 film 'Liv,' there is a scene from the restaurant, but the sign is different from what we see today—it reads 'Engebrets Café,' with an extra 's' compared to the current name. Additionally, Norway's Crown Princess Mette-Marit worked as a waitress at the restaurant on and off for four years. There is also a book from 1994 titled 'Nede på Engebret' if you want to read more about the restaurant's rich history.</p>",
        "where": "Engebret Café is just around where the old Norwegian bang buildings are.",
        "address": "Bankplassen 1, 0151 Oslo",
        "category": "restaurant",
        "image": "images/engebretcafe/engebretcafe01.jpg",
        "galleryPath": "images/engebretcafe",
        "galleryImages": ["engebretcafe01.jpg", "engebretcafe02.jpg", "engebretcafe03.jpg", "engebretcafe04.jpg"],
        "tags": ["local history", "restaurant", "food"],
        "latitude": 59.908920,
        "longitude": 10.742044,
        "favorite": true
    },
    {
        "id": 6,
        "title": "The Mini Bottle Gallery",
        "introduction": "In Oslo you can find the biggest collection of mini bottles in the world. A collection that one man started for more than 60 years ago, and today contains more than 50.000 bottles.",
        "description": "<p>The story of the small bottles began in the year of 1961 when Christian Ringnes was just 7 years old. From his traveling father, he received his first bottle—a small, empty bottle of Gordon's Dry Gin. This bottle gift would mark the beginning of what would later develop into a unique museum, a playground, a gathering point, and a universe unlike anything else.</p><p>Christian's great-great-grandfather established the esteemed Ringnes Brewery in 1877, and perhaps the interest in bottles can be traced back to that. Combined with a genuine passion for collecting and a father who traveled abroad for business, Christian gradually expanded his bottle collection over the years. With a keen sense of order and organization, Christian recorded every single small bottle in the 'bottle book for Ivar Aasens vei 28.' Alongside Christian’s first small bottle, this notebook is one of the museum’s most treasured possessions today.</p><p>In 1983, the collection continued into marriage, and understandably, Christian's wife was not thrilled with all the small bottles he insisted on displaying in their first apartment. After an accident where the shelves holding the cherished bottles collapsed from the wall, the bottles were packed away for a while. It is said that Christian’s wife smiled at this. However, at a later point, Christian brought the bottles out again—after being encouraged to find a hobby, and the dream of a small bottle universe was revived.</p><p>1996 was the year Christian purchased Kirkegaten 10, an ideal location for big dreams in the heart of Oslo's museum district. Four years later, the planning of the museum began, and in May 2003, The Mini Bottle Gallery opened its doors to the world, and a boyhood dream had become a reality.</p>",
        "where": "The Devil of Oslo can be found on the outside of Oslo Cathedral, just right of the main entrance. Look for the first corner facing the statue of King Christian the 4th. ",
        "address": "Kirkegata 10, 0152 Oslo",
        "category": "museum",
        "image": "images/minibottlegallery/minibottlegallery01.jpg",
        "galleryPath": "images/minibottlegallery",
        "galleryImages": ["minibottlegallery01.jpg", "minibottlegallery02.jpg", "minibottlegallery03.jpg", "minibottlegallery04.jpg"],
        "tags": ["museum", "gallery"],
        "homepage": "https://www.minibottlegallery.com",
        "latitude": 59.909685,
        "longitude": 10.743352,
        "favorite": true
    },
    {
        "id": 7,
        "title": "Museum of Oslo",
        "introduction": "Oslo’s own museum presents the city’s rich history through varied exhibitions. If you want to learn the history of Oslo–this is the museum to visit.",
        "description": "<p>The Museum of Oslo has been a part of Oslo Museum since 2006. It serves as the cultural history museum for Oslo and the former Aker district. The museum was founded on December 22, 1905, as the association 'Det gamle Christiania.' The initiative was led by architect Fritz Holland, who remained in charge until 1912. The museum is located at Frogner Manor in Frogner Park, where the first exhibitions were opened in the main building in 1909. In the 1980s, the east wing of the estate was developed for the Museum of Oslo's permanent city history exhibitions. In 2000, the museum's new administration building was completed on the east side of the estate, and the west wing was utilized in 2003 for temporary exhibitions. In its final year as an independent museum, Oslo City Museum had a total of 90,117 visitors.</p><p>Until the end of 2005, the Museum of Oslo was still organized as a private association but was primarily funded by public grants from Oslo Municipality and the state. The association was dissolved by decision of the general assembly on its centennial, December 22, 2005. At the same time, it was decided to establish a foundation to manage the ownership of the collections and a friends' association to represent the interests of its members. From January 1, 2006, the Museum of Oslo became part of the new foundation Oslo Museum, which took over operational responsibility. The new museum foundation initially operated under the working title 'Hovedstadsmuseet,' but since December 2006, it has been known as Oslo Museum. The Museum of Oslo, the Intercultural Museum (IKM), and the Theatre Museum joined forces to establish the new museum as a consequence of the national museum reform. For the time being, the three former entities continued to operate from their previous locations.</p><p>The Museum of Oslo has satellite exhibitions in workers' housing at Tøyen and Sagene. In 2008, it also opened the exhibition 'Christiania 1624 - 1850' in the Old Town Hall, but this had to be discontinued in 2010 due to financial constraints that forced the museum to terminate the lease with Oslo Municipality. The museum manages events and city walks under the 'Know Your City' program and publishes the journal Byminner (started in 1955). The collections include all types of objects related to the city's history and the lives and activities of its inhabitants. Particularly valuable are the Museum of Oslo's art collection and photo collection featuring Oslo scenes and portraits. The photo collection is one of the largest in the country and documents the city's development from the early days of photography to the present. In 2010, Oslo Museum, in collaboration with Oslo City Archives, launched the website oslobilder.no, offering searchable access to the digitized parts of the photo collections from both institutions.</p>",
        "where": "The museum can be found in Frognerparken close to Frogner Manor House with its glorious halls and interiors from circa 1750–1900.",
        "address": "Frognerveien 67, 0266 Oslo",
        "category": "museum",
        "image": "images/museumofoslo/museumofoslo01.jpg",
        "galleryPath": "images/museumofoslo",
        "galleryImages": ["museumofoslo01.jpg", "museumofoslo02.jpg", "museumofoslo03.jpg", "museumofoslo04.jpg"],
        "tags": ["local history", "city"],
        "latitude": 59.923911,
        "longitude": 10.702611,
        "favorite": true
    },
    {
        "id": 8,
        "title": "WW2 Graffiti: Be True to H7",
        "introduction": "A graffiti to support the Norwgian king Haakon VII made during the Second World War still stands today.",
        "description": "<p>In Uranienborgveien, there is a rare piece of graffiti dating back to World War II. During the occupation, a daring resistance fighter took some paint and wrote 'Vær tro mot H7' (Be true to H7) on the rock on the west side—right outside the premises where the Hirden (Nazi paramilitary organization) was based. H7, of course, refers to Haakon VII, who was the King of Norway from 1905 to 1957. Anyone who has seen the film “The King's Choice” knows the tough challenge Haakon VII faced when the Germans invaded Norway on April 9, 1940. This man gave his full support to the king and risked his life to show it on the rock. The rock cutting has been kept open and has been protected because it showcases the type of bedrock typical of Oslo. What you can see is shale with limestone nodules—whatever that might be. The graffiti piece is now preserved with a piece of plexiglass in front of it. None other than resistance hero Gunnar “Kjakan” Sønsteby was present to cut the ribbon when this was put in place.</p>",
        "where": "The graffiti can be found in Uranienborgveien just nest to Uraniensborg Park.",
        "address": "Uranienborgveien, 0258 Oslo",
        "category": "monument",
        "image": "images/ww2graffitibetruetoh7/ww2graffitibetruetoh701.jpg",
        "galleryPath": "images/ww2graffitibetruetoh7",
        "galleryImages": ["ww2graffitibetruetoh701.jpg", "ww2graffitibetruetoh702.jpg"],
        "tags": ["local history", "graffiti", "ww2", "war"],
        "latitude": 59.922214,
        "longitude": 10.721665,
        "favorite": true
    },
    {
        "id": 9,
        "title": "The Powder Tower",
        "introduction": "The Powder Tower was converted into a prison intended to hold the most dangerous and worst criminals.",
        "description": "<p>The Powder Tower, also known as the Powder House, was originally the tower where gunpowder was stored from 1755 onward. In 1830, the Powder Tower was converted into a prison intended to hold the most dangerous and worst criminals. As a result, we have some fantastic stories from the Powder Tower, and there are four prisoners, in particular, I want to highlight. Most intriguing, however, is the murder in the Powder Tower and the weapon that remains there to this day. But more on that later.</p><p>We begin with Gjest Baardsen—a gentleman criminal and escape artist. He is best known for his numerous jailbreaks, outsmarting sheriffs and bailiffs, and his many travels around the country. He gained a reputation as a Norwegian Robin Hood who fought against the injustices of those in power. In 1827, he was sentenced to life at hard labor and was confined in the Powder Tower. While there, he wrote his autobiography, which perhaps explains why the stories about him today seem so noble. A film about his life was made in 1939, and it remains quite good even today.</p><p>Next is Ole Høiland, a master thief and Casanova. He became somewhat of a folk hero, as he also played a bit of the Robin Hood role and was sympathetic toward ordinary people. He is best known as the only person to successfully rob Norges Bank, and he escaped from prison a total of 13 times. He eventually ended up in the Powder Tower—where he actually managed to escape. He sawed through the floor and dug his way through the ground beneath the walls, very much in a Dalton-style. He did the digging naked because he couldn’t afford to get dirt on his clothes, as that would have raised suspicion. But after three years, he was captured again, betrayed by those who were hiding him, and ended up back in the Powder Tower. There, he was put on display every Sunday in his chains as a warning of what could happen if you became a criminal. In the end, he took his own life by hanging himself in the Powder Tower. His life was portrayed in the Norwegian feature film 'Balladen om mestertyven Ole Høiland' from 1970.</p><p>Most people know Vidkun Quisling, the traitor whose surname has become synonymous with the words “traitor” and “Judas.” After the liberation of Norway, Quisling was convicted in 1945 for treason, murder, and theft in the Eidsivating Court of Appeal. He ended up in the Powder Tower. Not long after, he was executed at the execution site in Akershus Fortress. This was done in the dead of night in silence because they did not want to make him a martyr. They just wanted to get rid of him, and that they did.</p><p>The last one is the robber-murderer Rudolf Hansen. He is not as well-known as the other three I mentioned, but his story in the Powder Tower is the most thrilling of all. A brutal event involving him occurred in the Powder Tower. He was a robber and murderer, which is why he ended up there. One day, he decided to escape. He crafted a weapon from one of the bed legs, to which he attached large nails and a pair of scissors he had managed to smuggle in from the Slave Prison. The scissors were attached to provide the right weight for the weapon. He beat one of the guards to death in the Powder Tower. The guard’s life could not be saved. Hjalmar Hansen, a large guard who was standing outside the Powder Tower, heard the screams from inside and ran in. Rudolf was put in chains and later placed in 'the pit,' where he ended his life by hanging himself. The homemade murder weapon can still be seen in the Powder Tower today, and you can only imagine the bloody murder deep within the Powder Tower when you see the weapon.</p>",
        "where": "The Powder Tower can be found inside the walls of Akershus Fortress.",
        "address": "Akershus festning, 0150 Oslo",
        "category": "history",
        "image": "images/thepowdertower/thepowdertower01.jpg",
        "galleryPath": "images/thepowdertower",
        "galleryImages": ["thepowdertower01.jpg", "thepowdertower02.jpg", "thepowdertower03.jpg", "thepowdertower04.jpg", "thepowdertower05.jpg", "thepowdertower06.jpg", "thepowdertower07.jpg", "thepowdertower08.jpg", "thepowdertower09.jpg", "thepowdertower10.jpg", "thepowdertower11.jpg", "thepowdertower12.png"],
        "tags": ["local history", "prison"],
        "latitude": 59.907966,
        "longitude": 10.738691,
        "favorite": true
    },
    {
        "id": 10,
        "title": "Restaurant Schrøder: Harry Hole's Favorite Restaurant",
        "introduction": "Restaurant Schrøder is a classic pub and restaurant an old-fashioned style with paintings from the 1920s at St. Hanshaugen with traditional Norwegian food on the menu and a relaxed atmosphere that attracts a good mix of regulars, locals and visitors. One of locals is the famous detective Harry Hole.",
        "description": "<p>Nestled in the heart of St. Hanshaugen at Waldemar Thranes gate 8, Restaurant Schrøder is one of Oslo's last-standing traditional eateries—a true gem that has resisted time and trends. With its cozy, relaxed atmosphere, Schrøder is a meeting place for a diverse crowd: loyal regulars, neighborhood locals, and curious newcomers who seek a slice of Oslo’s storied past.</p><p>From the outside, Schrøder might not catch your eye with its modest facade, but step inside and you'll be transported back in time. The walls are adorned with striking paintings by Sigurd Fosnes from the 1920s, capturing nostalgic scenes of old Oslo, including Gamle Aker, Enerhaugen, and Torggata. Among these artworks is a special painting that features Restaurant Schrøder’s original location at Torggata 14, offering a glimpse into its roots.</p><p>The restaurant’s history dates back to 1925 when Hans Schrøder took over Elise Pettersen’s café, which had been a beloved local spot since 1912. Originally situated at the corner of Torggata and Henrik Ibsens gate, just a stone's throw from Youngstorget, the restaurant was forced to move when the building was demolished in 1954 to make way for the new Folkets Hus. In 1956, Schrøder reopened in a new building at its current location, which itself has a rich history, having housed restaurants since 1900.</p><p>But Schrøder is more than just a restaurant; it’s a literary landmark, immortalized in Jo Nesbø’s world-famous crime novels featuring the hard-boiled detective Harry Hole. Schrøder serves as Harry's favorite haunt, a place where he nurses his troubles with a drink, sinking into the comfort of its old wooden tables and dim lighting. It’s in these familiar surroundings that Harry Hole contemplates his next move, grapples with personal demons, and unwinds after chasing down Oslo’s most sinister criminals. The restaurant’s atmosphere, steeped in history and character, makes it the perfect backdrop for Harry’s gritty world.</p><p>Schrøder’s connection to Harry Hole and Jo Nesbø reached a new height in 2016 when Hollywood came knocking to film scenes from Nesbø’s thriller “The Snowman” right in the restaurant. This iconic location, with its vintage charm and storied walls, provided an authentic slice of Oslo life, forever linking it to the cinematic adaptation of Nesbø’s dark and gripping universe.</p><p>So whether you’re a die-hard fan of Jo Nesbø’s novels, a lover of classic Norwegian cuisine, or simply someone who appreciates the allure of a bygone era, Restaurant Schrøder offers a unique experience that’s as much about soaking in the atmosphere as it is about the food. Here, you’re not just dining; you’re stepping into the pages of Oslo’s literary and cultural history.</p>",
        "where": "Restaurant Schrøder can be found at St. Haunshaugen, not far from the park.",
        "address": "Waldemar Thranes gate 8, 0171 Oslo",
        "category": "restaurant",
        "image": "images/schroder/schroder01.jpg",
        "galleryPath": "images/schroder",
        "galleryImages": ["schroder01.jpg", "schroder02.jpg", "schroder03.jpg", "schroder04.jpg", "schroder05.jpg", "schroder06.jpg"],
        "tags": ["local history", "food", "restraurant", "harry hole"],
        "homepage": "https://www.restaurant-schrøder.no",
        "latitude": 59.923416,
        "longitude": 10.739474,
        "favorite": true
    },
    {
        "id": 11,
        "title": "Den Glade Gris",
        "introduction": "Den Glade Gris is a unique dining experience in the heart of Oslo, specializing in dishes made from pork, with their signature slow-roasted pork knuckle.",
        "description": "<p>Welcome to a distinctive culinary experience in the heart of Oslo! Den Glade Gris specializes in dishes made from pork, with the house specialty being the slow-roasted pork knuckle. The restaurant embraces the slow-cooking method, marinating and roasting their dishes over several days to ensure maximum flavor and incredibly tender meat.</p><p>Den Glade Gris offers hearty Norwegian cuisine presented in an honest and rustic style. The restaurant collaborates with breweries from across the country, resulting in a wide selection of beers. Service is friendly and informal, delivered with a humorous touch. Every day, they prepare two lunch soups using surplus ingredients from the previous day, promoting sustainability.</p><p>The restaurant takes pride in using pork from well-cared-for pigs, ensuring the meat is succulent and flavorful. They source their meat from Krosby Kjøtt in Oslo, which works with reputable Norwegian farmers. One of their key suppliers, Jan Bredo Våland, has been a pig farmer in Jæren for over 40 years, raising around 2,100 pigs annually. His farm adheres to stringent animal welfare standards, including daily inspections of each pig and a maximum transport time of one hour to the slaughterhouse, exceeding Norwegian regulatory requirements.</p><p>At Våland, pigs live comfortably for their 6-7 month lifespan, with heated floors for the youngest pigs and excellent ventilation. Each pen includes a plastic ball for the pigs to play with, though they are generally content to lounge together in their pen. Their specially formulated feed keeps them healthy and thriving. Disease prevention is a top priority, and strict biosecurity measures are in place, including the use of full protective suits for visitors entering the barn.</p><p>Den Glade Gris is proud to source their meat from dedicated farmers like Jan Bredo Våland, who ensure high standards of animal welfare and quality.</p>",
        "where": "Located centrally in Oslo, Den Glade Gris is the perfect spot to enjoy authentic Norwegian pork dishes with a rustic twist.",
        "address": "St. Olavs Gate 33, 0166 Oslo",
        "category": "restaurant",
        "image": "images/dengladegris/dengladegris01.jpg",
        "galleryPath": "images/dengladegris",
        "galleryImages": ["dengladegris01.jpg", "dengladegris02.jpg", "dengladegris03.jpg"],
        "tags": ["restaurant", "food"],
        "homepage": "https://www.dengladegris.no/",
        "latitude": 59.917831,
        "longitude": 10.733562,
        "favorite": true
    },
    {
        "id": 12,
        "title": "The Cannonball on the Wall",
        "introduction": "The Swedish King Charles XII attacked Oslo in 1716. Cannoballs were shot towards the Swedish army, and one can still be seen today.",
        "description": "<p>We go back to 1716 when the Swedish King Charles XII attacked Oslo, or Kristiania as it was called then, with 7,000 men. The Swedes advanced through Ås and continued over the ice on Bunnefjorden, as the roads towards Kristiania had been blocked. On March 21, they reached Kristiania, but Norway fired cannons at the Swedes, causing the ice to crack. The Swedes landed on Bleikøya, Hovedøya, and Nakkholmen. The forces eventually landed on Bygdøy and then moved across Frognerkilen towards Gamle Aker Church. By that time, Kristiania had been evacuated. Only Akershus Fortress stood against the Swedish attack, doing everything it could to send the Swedes back where they came from. After a month of siege, the Swedes were forced to retreat in defeat.</p><p>One of the cannonballs fired at the Swedes from Akershus Fortress ended up embedded in the wall of the Departementsgården building. When Departementsgården was demolished in 1914 to make way for Oslo's new main post office, the cannonball was preserved and embedded into the wall of the new building. You can still see it there today.</p><p>And what happened to the power-hungry Swedish King Charles XII? He tried again two years later, now with 40,000 men, against Fredriksten Fortress in Halden. As he peeked up from the moat, he was hit in the head by a bullet and died at just 36 years old. Charles XII became king at the age of fifteen and spent most of his reign waging wars. It is said that it was a Swedish bullet that killed him at Fredriksten Fortress, as the Swedes were tired of his constant warfare. However, in Myking on the west coast of Norway, Jo Vedlo Hodne has been credited with the fatal shot, and a monument has been erected in his memory.</p><p>The Swedish king has also been popularized in modern culture, such as in <em>Brødrene Dal og mysteriet med Karl XIIs gamasjer</em> and Sabaton's concept album <em>Carolus Rex</em>. You can also see him in many films, including the six-hour long <em>Karl XII</em> from 1925. But best of all, you can see an actual cannonball from the war against Charles XII in the wall of the old post office!</p>",
        "where": "The cannoball can be found on the south-east side of the old Oslo Main Post Office. Look up about ten meters.",
        "address": "Dronningens gt. 15, 0152 Oslo",
        "category": "monument",
        "image": "images/cannonball/cannonball01.jpg",
        "galleryPath": "images/cannonball",
        "galleryImages": ["cannonball01.jpg", "cannonball02.jpg", "cannonball03.jpg"],
        "tags": ["war", "war monument"],
        "latitude": 59.910106,
        "longitude": 10.745901,
        "favorite": true
    }  
]