[
    {
        "id": 1,
        "title": "The Carousel of Love",
        "introduction": "The urinal, known by many names and designated as a Norwegian Cultural Heritage Site for its simple and functional design, stands as a testament to old gay history in Norway.",
        "description": "<p>There is a Norwegian saying that can be translated to “A dear child has many names.” The same applies to this 1937 urinal, referred to not only as “the Carousel of Love” (or Kjærlighetskarusellen in Norwegian) but also as 'the Wheel of Fortune,' 'the Round Barrel,' 'the Mushroom,' and 'the Umbrella.' This variety in names reflects its role as a gathering place for homosexual men during a time when homosexuality was socially unacceptable and illegal in Norway.</p><p>The Carousel of Love served as an important meeting place for gay men during a time when homosexuality was taboo in Norway, and sex between men was illegal until 1972.</p><p>In 2009, the urinal was declared a Norwegian Cultural Heritage Site, aimed at highlighting the diversity and importance of Norway’s cultural heritage for all sectors of the community. Located in Stensparken in Oslo, the functionalist urinal is perhaps the most iconic example of queer architecture in Norway. Designed by Oslo’s city architect Harald Aars and completed in 1937, it was intended to fulfill hygienic and practical considerations while also serving as a sculptural element in the park. In connection with the Queer Culture Year in 2022, artist Per Barclay initiated the restoration of the urinal and the installation of lighting.</p>",
        "where": "You can find the Carousel of Love in Stensparken in Oslo, next to Fagerborg Church.",
        "address": "Sporveisgata, 0354 Oslo",
        "category": "monuments",
        "image": "./images/thecarouseloflove/thecarouseloflove01.jpg",
        "galleryPath": "../images/thecarouseloflove",
        "galleryImages": ["thecarouseloflove01.jpg", "thecarouseloflove02.jpg", "thecarouseloflove03.jpg", "thecarouseloflove04.jpg"],
        "tags": ["local history", "design"],
        "favorite": true
    },
    {
        "id": 2,
        "title": "The Devil of Oslo",
        "introduction": "In downtown Oslo, a menacing and terrifying relief clings to a church wall only known as The Devil of Oslo.",
        "description": "<p>The Devil of Oslo is a favorite stop for tourist guides. After showing their group the statue of king Karl Johan, the citys founding father, they dicrect the group to the closest corner of The Cathedral where the 'Oslo-devil' is found.</p><p>The Oslo Cathedral was consecrated in 1697 and is one of the most famous churches in Norway. The Devil of Oslo, however, is much older. The devil is about 900-years-old and was found among the ruins of St. Hallvard’s Cathedral. The statue was removed from the ruins and grumbled onto the walls of the Oslo Cathedral. The figure depicts a man being attacked on both sides by a dragon and a lion.</p>",
        "where": "The Devil of Oslo can be found on the outside of Oslo Cathedral, just right of the main entrance. Look for the first corner facing the statue of King Christian the 4th.",
        "address": "Karl Johans gt. 11, 0154 Oslo",
        "category": "monuments",
        "image": "../images/thedevilofoslo/thedevilofoslo01.jpg",
        "galleryPath": "../images/thedevilofoslo",
        "galleryImages": ["thedevilofoslo01.jpg", "thedevilofoslo02.jpg", "thedevilofoslo03.jpg", "thedevilofoslo04.jpg"],
        "tags": ["local history", "religion"],
        "favorite": true
    },
    {
        "id": 3,
        "title": "Syverkiosken",
        "introduction": "The only remaining hot dog kiosk in Oslo still lives strongly, and still offers the best hot dogs Oslo has to offer.",
        "description": "<p>In the old days, Oslo was full of hot dog stands, and I’m not talking about Narvesen and Deli De Luca, but proper hot dog stands that focused solely on sausages. At one time, Oslo had over a hundred of these. Today, only one remains, and it’s called Syverkiosken. Here you’ll meet the talkative and friendly Erlend, who took over the stand from his father, who bought it way back in 1971 when it was called «Joss sin». However, the hot dog stand is much older than that. So old that no one really knows when it started. Some say the 1950s, while other sources suggest 1937 as the starting point. Erlend runs the stand every day all year round, only taking Christmas Eve off. This guy knows how to chat—so expect to have a little conversation thrown in with your purchase.</p><p>In the twelve-square-meter stand, Erlend runs the show, serving only one type of wienerpølse that is specially made for Syverkiosken and available nowhere else. Everything else is homemade too, including the ketchup and mashed potatoes. Syverkiosken has gained international recognition, and the British newspaper The Guardian featured an article about the stand titled 'Hotdog Heaven on the Streets of Oslo.' It was also featured on the travel TV series «Travel Man», with Richard Ayoade from «The IT Crowd», where they praised the sausages as some of the best they’d ever tasted.</p><p>The hot dog stand is even mentioned in the Lillebjørn Nilsen song «Alexander Kiellands Plass» with the line: 'Og ved Joss sin pølsebu sa hun: 'Kanskje vi ses igjen?'' Additionally, Mulegutten from the book «Altmuligmannen en internasjonal storpolitisk thriller» is a regular customer at the stand. Apparently, Rolv Wesenlund was too. So, you’re in good company here!</p>",
        "where": "Syverkiosen is at Alexander Kjellands Plass. Look for the grafitti with the Dalton Brothers.",
        "address": "Maridalsveien 45B, 0175 Oslo",
        "category": "restaurant",
        "image": "../images/syverkiosken/syverkiosken01.jpg",
        "galleryPath": "../images/syverkiosken",
        "galleryImages": ["syverkiosken01.jpg", "syverkiosken02.jpg", "syverkiosken03.jpg", "syverkiosken04.jpg", "syverkiosken05.jpg"],
        "tags": ["local history", "food", "restaurant"],
        "favorite": true
    },
    {
        "id": 4,
        "title": "James Caan's Favorite Burger: Valkyrien Grill",
        "introduction": "Famous Hollywood actor James Caan has a favorite burger and it is in Oslo.",
        "description": "<p>At Valkyries Plass, near Majorstuen, we find the closed-down subway station Valkyrie Plass Station. It was shut down in 1985 because it was so close to Majorstuen subway station. A Narvesen kiosk was built where the entrance used to be, which later turned into a fast-food joint that still stands today, called Valkyrien Grill. Part of the filming for the fantastic TV series “Valkyrien” took place in the fast-food joint, and the staircase down to the station can be found through a side door by the entrance. Cool in itself, but let’s go back to 1996, during the filming of the movie “North Star,” also known as “Tashunga.” James Caan, perhaps best known as Sonny in “The Godfather,” had the leading role. The movie is set in Alaska but was filmed in Maridalen in Oslo.</p><p>James Caan, being a true American, wanted the best burger in town and was tipped off about Valkyrien Grill. He jumped into his limousine, which took him to Majorstuen. He liked it so much that he came every day during the filming of the movie. He simply couldn’t get enough of the juicy burger at Valkyrien Grill. Note that it's the tenderloin burger that’s the star. Filming eventually ended, and things went back to normal. That was until an interview with James Caan appeared in an American newspaper about where to find the best food, and yes, it was, of course, the burger at Valkyrien Grill in Oslo! “In the capital of Norway!” he said. A Norwegian exchange student had read the interview and made sure to send it over to Valkyrien Grill, which they proudly displayed. Well deserved—because the burger is good—very good!</p>",
        "where": "Valkyrien Grill is at the start of the park Valkyrians plass. The old station house is now used for the burger joint",
        "address": "Bogstadveien 71B, 0366 Oslo",
        "category": "restaurant",
        "image": "../images/valkyriengrill/valkyriengrill01.jpg",
        "galleryPath": "../images/valkyriengrill",
        "galleryImages": ["valkyriengrill01.jpg", "valkyriengrill02.jpg", "valkyriengrill03.jpg", "valkyriengrill04.jpg", "valkyriengrill05.jpg", "valkyriengrill06.jpg", "valkyriengrill07.jpg"],
        "tags": ["local history", "food", "restaurant"],
        "favorite": true
    },
    {
        "id": 5,
        "title": "Engebret Café",
        "introduction": "Do you want to eat where all the most famous Norwegian's used to eat? You can do it at Norway's oldest restaruant.",
        "description": "<p>Engebret is Norway's oldest restaurant still in operation, having opened back in 1857. Originally located at Rådhusgata 11, Engebret moved just a few years later, in 1863, to Bankplassen, where it remains today. Little has changed in the café since then. Many of Norway's great artists and writers of the past had regular tables here, including Ibsen, Grieg, Bjørnstjerne Bjørnson, Hamsun, Edvard Munch, Johanne Dybwad, Sigrid Undset, Peter Christen Asbjørnsen, Johan Sverdrup, and many more. Some of these have plaques at the tables indicating which ones were their regular spots. Edvard Munch, known for his heavy drinking, was even thrown out of the restaurant after a drunken spree, which led him to resign from the Oslo Art Association. The letter of his resignation is actually displayed at the entrance of Engebret.</p><p>Another amusing story involves regular guest Bjørnstjerne Bjørnson, who jokingly asked a nervous young waiter if he had hemorrhoids because he was so restless. The waiter ran to the kitchen to check if they had hemorrhoids on the menu but returned embarrassed when he learned what they were. This backfired on Bjørnson when he later ordered artichokes; the waiter just laughed and said he wouldn’t fall for that again. Former Prime Minister Johan Sverdrup once forgot to pay his bill of 2.90 kroner in 1884. Lars Sponheim settled that bill on May 21, 2008.</p><p>Many TV series and films have taken place at Engebret Café. Most famously, the show 'Husker du' with Odd Gryte ran for fourteen years. In the 1967 film 'Liv,' there is a scene from the restaurant, but the sign is different from what we see today—it reads 'Engebrets Café,' with an extra 's' compared to the current name. Additionally, Norway's Crown Princess Mette-Marit worked as a waitress at the restaurant on and off for four years. There is also a book from 1994 titled 'Nede på Engebret' if you want to read more about the restaurant's rich history.</p>",
        "where": "Engebret Café is just around where the old Norwegian bang buildings are.",
        "address": "Karl Johans gt. 11, 0154 Oslo",
        "category": "restaurant",
        "image": "../images/engebretcafe/engebretcafe01.jpg",
        "galleryPath": "../images/engebretcafe",
        "tags": ["local history", "restaurant", "food"],
        "favorite": true
    },
    {
        "id": 6,
        "title": "The Mini Bottle Gallery",
        "introduction": "In Oslo you can find the biggest collection of mini bottles in the world. A collection that one man started for more than 60 years ago, and today contains more than 50.000 bottles.",
        "description": "<p>The story of the small bottles began in the year of 1961 when Christian Ringnes was just 7 years old. From his traveling father, he received his first bottle—a small, empty bottle of Gordon's Dry Gin. This bottle gift would mark the beginning of what would later develop into a unique museum, a playground, a gathering point, and a universe unlike anything else.</p><p>Christian's great-great-grandfather established the esteemed Ringnes Brewery in 1877, and perhaps the interest in bottles can be traced back to that. Combined with a genuine passion for collecting and a father who traveled abroad for business, Christian gradually expanded his bottle collection over the years. With a keen sense of order and organization, Christian recorded every single small bottle in the 'bottle book for Ivar Aasens vei 28.' Alongside Christian’s first small bottle, this notebook is one of the museum’s most treasured possessions today.</p><p>In 1983, the collection continued into marriage, and understandably, Christian's wife was not thrilled with all the small bottles he insisted on displaying in their first apartment. After an accident where the shelves holding the cherished bottles collapsed from the wall, the bottles were packed away for a while. It is said that Christian’s wife smiled at this. However, at a later point, Christian brought the bottles out again—after being encouraged to find a hobby, and the dream of a small bottle universe was revived.</p><p>1996 was the year Christian purchased Kirkegaten 10, an ideal location for big dreams in the heart of Oslo's museum district. Four years later, the planning of the museum began, and in May 2003, The Mini Bottle Gallery opened its doors to the world, and a boyhood dream had become a reality.</p>",
        "where": "The Devil of Oslo can be found on the outside of Oslo Cathedral, just right of the main entrance. Look for the first corner facing the statue of King Christian the 4th. ",
        "address": "Kirkegata 10, 0152 Oslo",
        "category": "museum",
        "image": "../images/minibottlegallery/minibottlegallery01.jpg",
        "galleryPath": "../images/minibottlegallery",
        "tags": ["museum", "gallery"],
        "homepage": "https://www.minibottlegallery.com",
        "favorite": true
    },
    {
        "id": 7,
        "title": "Museum of Oslo",
        "introduction": "Oslo’s own museum presents the city’s rich history through varied exhibitions. If you want to learn the history of Oslo–this is the museum to visit.",
        "description": "<p>The Museum of Oslo has been a part of Oslo Museum since 2006. It serves as the cultural history museum for Oslo and the former Aker district. The museum was founded on December 22, 1905, as the association 'Det gamle Christiania.' The initiative was led by architect Fritz Holland, who remained in charge until 1912. The museum is located at Frogner Manor in Frogner Park, where the first exhibitions were opened in the main building in 1909. In the 1980s, the east wing of the estate was developed for the Museum of Oslo's permanent city history exhibitions. In 2000, the museum's new administration building was completed on the east side of the estate, and the west wing was utilized in 2003 for temporary exhibitions. In its final year as an independent museum, Oslo City Museum had a total of 90,117 visitors.</p><p>Until the end of 2005, the Museum of Oslo was still organized as a private association but was primarily funded by public grants from Oslo Municipality and the state. The association was dissolved by decision of the general assembly on its centennial, December 22, 2005. At the same time, it was decided to establish a foundation to manage the ownership of the collections and a friends' association to represent the interests of its members. From January 1, 2006, the Museum of Oslo became part of the new foundation Oslo Museum, which took over operational responsibility. The new museum foundation initially operated under the working title 'Hovedstadsmuseet,' but since December 2006, it has been known as Oslo Museum. The Museum of Oslo, the Intercultural Museum (IKM), and the Theatre Museum joined forces to establish the new museum as a consequence of the national museum reform. For the time being, the three former entities continued to operate from their previous locations.</p><p>The Museum of Oslo has satellite exhibitions in workers' housing at Tøyen and Sagene. In 2008, it also opened the exhibition 'Christiania 1624 - 1850' in the Old Town Hall, but this had to be discontinued in 2010 due to financial constraints that forced the museum to terminate the lease with Oslo Municipality. The museum manages events and city walks under the 'Know Your City' program and publishes the journal Byminner (started in 1955). The collections include all types of objects related to the city's history and the lives and activities of its inhabitants. Particularly valuable are the Museum of Oslo's art collection and photo collection featuring Oslo scenes and portraits. The photo collection is one of the largest in the country and documents the city's development from the early days of photography to the present. In 2010, Oslo Museum, in collaboration with Oslo City Archives, launched the website oslobilder.no, offering searchable access to the digitized parts of the photo collections from both institutions.</p>",
        "where": "The museum can be found in Frognerparken close to Frogner Manor House with its glorious halls and interiors from circa 1750–1900.",
        "address": "Karl Johans gt. 11, 0154 Oslo",
        "category": "museums",
        "image": "../images/museumofoslo/museumofoslo01.jpg",
        "galleryPath": "../images/museumofoslo",
        "tags": ["local history", "religion"],
        "favorite": true
    },
    {
        "id": 8,
        "title": "The Devil of Oslo",
        "introduction": "In downtown Oslo, a menacing and terrifying relief clings to a church wall only known as The Devil of Oslo.",
        "description": "The Oslo Cathedral was consecrated in 1697 and is one of the most famous churches in Norway. The Devil of Oslo, however, is much older. The devil is about 900-years-old and was found among the ruins of St. Hallvard’s Cathedral. The statue was removed from the ruins and grumbled onto the walls of the Oslo Cathedral. The figure depicts a man being attacked on both sides by a dragon and a lion.",
        "where": "The Devil of Oslo can be found on the outside of Oslo Cathedral, just right of the main entrance. Look for the first corner facing the statue of King Christian the 4th. ",
        "address": "Karl Johans gt. 11, 0154 Oslo",
        "category": "monuments",
        "image": "../images/thedevilsofoslo01.jpg",
        "galleryPath": "../images/museumofoslo",
        "tags": ["local history", "religion"],
        "favorite": true
    },
    {
        "id": 9,
        "title": "The Devil of Oslo",
        "introduction": "In downtown Oslo, a menacing and terrifying relief clings to a church wall only known as The Devil of Oslo.",
        "description": "The Oslo Cathedral was consecrated in 1697 and is one of the most famous churches in Norway. The Devil of Oslo, however, is much older. The devil is about 900-years-old and was found among the ruins of St. Hallvard’s Cathedral. The statue was removed from the ruins and grumbled onto the walls of the Oslo Cathedral. The figure depicts a man being attacked on both sides by a dragon and a lion.",
        "where": "The Devil of Oslo can be found on the outside of Oslo Cathedral, just right of the main entrance. Look for the first corner facing the statue of King Christian the 4th. ",
        "address": "Karl Johans gt. 11, 0154 Oslo",
        "category": "monuments",
        "image": "../images/thedevilsofoslo01.jpg",
        "galleryPath": "../images/museumofoslo",
        "tags": ["local history", "religion"],
        "favorite": true
    }
]