[
    {
        "id": 1,
        "title": "The Carousel of Love",
        "introduction": "The urinal, known by many names and designated as a Norwegian Cultural Heritage Site for its simple and functional design, stands as a testament to old gay history in Norway.",
        "description": "<p>There is a Norwegian saying that can be translated to “A dear child has many names.” The same applies to this 1937 urinal, referred to not only as “the Carousel of Love” (or Kjærlighetskarusellen in Norwegian) but also as 'the Wheel of Fortune,' 'the Round Barrel,' 'the Mushroom,' and 'the Umbrella.' This variety in names reflects its role as a gathering place for homosexual men during a time when homosexuality was socially unacceptable and illegal in Norway.</p><p>The Carousel of Love served as an important meeting place for gay men during a time when homosexuality was taboo in Norway, and sex between men was illegal until 1972.</p><p>In 2009, the urinal was declared a Norwegian Cultural Heritage Site, aimed at highlighting the diversity and importance of Norway’s cultural heritage for all sectors of the community. Located in Stensparken in Oslo, the functionalist urinal is perhaps the most iconic example of queer architecture in Norway. Designed by Oslo’s city architect Harald Aars and completed in 1937, it was intended to fulfill hygienic and practical considerations while also serving as a sculptural element in the park. In connection with the Queer Culture Year in 2022, artist Per Barclay initiated the restoration of the urinal and the installation of lighting.</p>",
        "where": "You can find the Carousel of Love in Stensparken in Oslo, next to Fagerborg Church.",
        "address": "Sporveisgata, 0354 Oslo",
        "category": ["monument"],
        "image": "images/thecarouseloflove/thecarouseloflove01.jpg",
        "galleryPath": "images/thecarouseloflove",
        "galleryImages": ["thecarouseloflove01.jpg", "thecarouseloflove02.jpg", "thecarouseloflove03.jpg", "thecarouseloflove04.jpg"],
        "tags": ["local history", "design"],
        "homepage": "",
        "secretLevel": "7",
        "latitude": 59.926962,
        "longitude": 10.729680,
        "favorite": true,
        "date": "2024-08-18"
    },
    {
        "id": 2,
        "title": "The Devil of Oslo",
        "introduction": "In downtown Oslo, a menacing and terrifying relief clings to a church wall only known as The Devil of Oslo.",
        "description": "<p>The Devil of Oslo is a favorite stop for tourist guides. After showing their group the statue of king Karl Johan, the citys founding father, they dicrect the group to the closest corner of The Cathedral where the 'Oslo-devil' is found.</p><p>The Oslo Cathedral was consecrated in 1697 and is one of the most famous churches in Norway. The Devil of Oslo, however, is much older. The devil is about 900-years-old and was found among the ruins of St. Hallvard’s Cathedral. The statue was removed from the ruins and grumbled onto the walls of the Oslo Cathedral. The figure depicts a man being attacked on both sides by a dragon and a lion.</p>",
        "where": "The Devil of Oslo can be found on the outside of Oslo Cathedral, just right of the main entrance. Look for the first corner facing the statue of King Christian the 4th.",
        "address": "Karl Johans gt. 11, 0154 Oslo",
        "category": ["monument"],
        "image": "images/thedevilofoslo/thedevilofoslo01.jpg",
        "galleryPath": "images/thedevilofoslo",
        "galleryImages": ["thedevilofoslo01.jpg", "thedevilofoslo02.jpg", "thedevilofoslo03.jpg", "thedevilofoslo04.jpg"],
        "tags": ["local history", "religion"],
        "homepage": "",
        "secretLevel": "8",
        "latitude": 59.912626,
        "longitude": 10.746361,
        "favorite": true,
        "date": "2024-08-19"
    },
    {
        "id": 3,
        "title": "Syverkiosken",
        "introduction": "The only remaining hot dog kiosk in Oslo still lives strongly, and still offers the best hot dogs Oslo has to offer. The tiny wooden kiosk has become world famous after being in several TV shows, newspapers, songs, and books.",
        "description": "<p>In the old days, Oslo was full of hot dog stands, and I’m not talking about Narvesen and Deli De Luca, but proper hot dog stands that focused solely on sausages. At one time, Oslo had over a hundred of these. Today, only one remains, and it’s called Syverkiosken. Here you’ll meet the talkative and friendly Erlend, who took over the stand from his father, who bought it way back in 1971 when it was called «Joss sin». However, the hot dog stand is much older than that. So old that no one really knows when it started. Some say the 1950s, while other sources suggest 1937 as the starting point. Erlend runs the stand every day all year round, only taking Christmas Eve off. This guy knows how to chat—so expect to have a little conversation thrown in with your purchase.</p><p>In the twelve-square-meter stand, Erlend runs the show, serving only one type of wienerpølse that is specially made for Syverkiosken and available nowhere else. Everything else is homemade too, including the ketchup and mashed potatoes. Syverkiosken has gained international recognition, and the British newspaper The Guardian featured an article about the stand titled 'Hotdog Heaven on the Streets of Oslo.' It was also featured on the travel TV series «Travel Man», with Richard Ayoade from «The IT Crowd», where they praised the sausages as some of the best they’d ever tasted.</p><p>The hot dog stand is even mentioned in the Lillebjørn Nilsen song «Alexander Kiellands Plass» with the line: 'Og ved Joss sin pølsebu sa hun: 'Kanskje vi ses igjen?'' Additionally, Mulegutten from the book «Altmuligmannen en internasjonal storpolitisk thriller» is a regular customer at the stand. Apparently, Rolv Wesenlund was too. So, you’re in good company here!</p>",
        "where": "Syverkiosen is at Alexander Kjellands Plass. Look for the grafitti with the Dalton Brothers.",
        "address": "Maridalsveien 45B, 0175 Oslo",
        "category": ["restaurant"],
        "image": "images/syverkiosken/syverkiosken01.jpg",
        "galleryPath": "images/syverkiosken",
        "galleryImages": ["syverkiosken01.jpg", "syverkiosken02.jpg", "syverkiosken03.jpg", "syverkiosken04.jpg", "syverkiosken05.jpg"],
        "tags": ["local history", "food", "restaurant"],
        "homepage": "",
        "secretLevel": "2",
        "latitude": 59.928266,
        "longitude": 10.752394,
        "favorite": true,
        "date": "2024-08-20"
    },
    {
        "id": 4,
        "title": "James Caan's Favorite Burger: Valkyrien Grill",
        "introduction": "Famous Hollywood actor James Caan, wll-known as Sonny Corleone in The Godfather, has a favorite burger and it is in Oslo. The movie 'North Star' was shot in Norway in 1996 and James Caan needed is burger every day from this small burger joint called Valkyrien Grill.",
        "description": "<p>At Valkyries Plass, near Majorstuen, we find the closed-down subway station Valkyrie Plass Station. It was shut down in 1985 because it was so close to Majorstuen subway station. A Narvesen kiosk was built where the entrance used to be, which later turned into a fast-food joint that still stands today, called Valkyrien Grill. Part of the filming for the fantastic TV series “Valkyrien” took place in the fast-food joint, and the staircase down to the station can be found through a side door by the entrance. Cool in itself, but let’s go back to 1996, during the filming of the movie “North Star,” also known as “Tashunga.” James Caan, perhaps best known as Sonny in “The Godfather,” had the leading role. The movie is set in Alaska but was filmed in Maridalen in Oslo.</p><p>James Caan, being a true American, wanted the best burger in town and was tipped off about Valkyrien Grill. He jumped into his limousine, which took him to Majorstuen. He liked it so much that he came every day during the filming of the movie. He simply couldn’t get enough of the juicy burger at Valkyrien Grill. Note that it's the tenderloin burger that’s the star. Filming eventually ended, and things went back to normal. That was until an interview with James Caan appeared in an American newspaper about where to find the best food, and yes, it was, of course, the burger at Valkyrien Grill in Oslo! “In the capital of Norway!” he said. A Norwegian exchange student had read the interview and made sure to send it over to Valkyrien Grill, which they proudly displayed. Well deserved—because the burger is good—very good!</p>",
        "where": "Valkyrien Grill is at the start of the park Valkyrians plass. The old station house is now used for the burger joint",
        "address": "Bogstadveien 71B, 0366 Oslo",
        "category": ["restaurant"],
        "image": "images/valkyriengrill/valkyriengrill01.jpg",
        "galleryPath": "images/valkyriengrill",
        "galleryImages": ["valkyriengrill01.jpg", "valkyriengrill02.jpg", "valkyriengrill03.jpg", "valkyriengrill04.jpg", "valkyriengrill05.jpg", "valkyriengrill06.jpg", "valkyriengrill07.jpg"],
        "tags": ["local history", "food", "restaurant"],
        "homepage": "",
        "secretLevel": "3",
        "latitude": 59.928139,
        "longitude": 10.718283,
        "favorite": true,
        "date": "2024-08-21"
    },
    {
        "id": 5,
        "title": "Engebret Café",
        "introduction": "Do you want to eat where all the most famous Norwegian's used to eat? You can do it at Norway's oldest restaurant.",
        "description": "<p>Engebret is Norway's oldest restaurant still in operation, having opened back in 1857. Originally located at Rådhusgata 11, Engebret moved just a few years later, in 1863, to Bankplassen, where it remains today. Little has changed in the café since then. Many of Norway's great artists and writers of the past had regular tables here, including Ibsen, Grieg, Bjørnstjerne Bjørnson, Hamsun, Edvard Munch, Johanne Dybwad, Sigrid Undset, Peter Christen Asbjørnsen, Johan Sverdrup, and many more. Some of these have plaques at the tables indicating which ones were their regular spots. Edvard Munch, known for his heavy drinking, was even thrown out of the restaurant after a drunken spree, which led him to resign from the Oslo Art Association. The letter of his resignation is actually displayed at the entrance of Engebret.</p><p>Another amusing story involves regular guest Bjørnstjerne Bjørnson, who jokingly asked a nervous young waiter if he had hemorrhoids because he was so restless. The waiter ran to the kitchen to check if they had hemorrhoids on the menu but returned embarrassed when he learned what they were. This backfired on Bjørnson when he later ordered artichokes; the waiter just laughed and said he wouldn’t fall for that again. Former Prime Minister Johan Sverdrup once forgot to pay his bill of 2.90 kroner in 1884. Lars Sponheim settled that bill on May 21, 2008.</p><p>Many TV series and films have taken place at Engebret Café. Most famously, the show 'Husker du' with Odd Gryte ran for fourteen years. In the 1967 film 'Liv,' there is a scene from the restaurant, but the sign is different from what we see today—it reads 'Engebrets Café,' with an extra 's' compared to the current name. Additionally, Norway's Crown Princess Mette-Marit worked as a waitress at the restaurant on and off for four years. There is also a book from 1994 titled 'Nede på Engebret' if you want to read more about the restaurant's rich history.</p>",
        "where": "Engebret Café is just around where the old Norwegian bang buildings are.",
        "address": "Bankplassen 1, 0151 Oslo",
        "category": ["restaurant"],
        "image": "images/engebretcafe/engebretcafe01.jpg",
        "galleryPath": "images/engebretcafe",
        "galleryImages": ["engebretcafe01.jpg", "engebretcafe02.jpg", "engebretcafe03.jpg", "engebretcafe04.jpg"],
        "tags": ["local history", "restaurant", "food"],
        "homepage": "",
        "secretLevel": "2",
        "latitude": 59.908920,
        "longitude": 10.742044,
        "favorite": true,
        "date": "2024-08-22"
    },
    {
        "id": 6,
        "title": "The Mini Bottle Gallery",
        "introduction": "In Oslo you can find the biggest collection of mini bottles in the world. A collection that one man started for more than 60 years ago, and today contains more than 50.000 bottles.",
        "description": "<p>The story of the small bottles began in the year of 1961 when Christian Ringnes was just 7 years old. From his traveling father, he received his first bottle—a small, empty bottle of Gordon's Dry Gin. This bottle gift would mark the beginning of what would later develop into a unique museum, a playground, a gathering point, and a universe unlike anything else.</p><p>Christian's great-great-grandfather established the esteemed Ringnes Brewery in 1877, and perhaps the interest in bottles can be traced back to that. Combined with a genuine passion for collecting and a father who traveled abroad for business, Christian gradually expanded his bottle collection over the years. With a keen sense of order and organization, Christian recorded every single small bottle in the 'bottle book for Ivar Aasens vei 28.' Alongside Christian’s first small bottle, this notebook is one of the museum’s most treasured possessions today.</p><p>In 1983, the collection continued into marriage, and understandably, Christian's wife was not thrilled with all the small bottles he insisted on displaying in their first apartment. After an accident where the shelves holding the cherished bottles collapsed from the wall, the bottles were packed away for a while. It is said that Christian’s wife smiled at this. However, at a later point, Christian brought the bottles out again—after being encouraged to find a hobby, and the dream of a small bottle universe was revived.</p><p>1996 was the year Christian purchased Kirkegaten 10, an ideal location for big dreams in the heart of Oslo's museum district. Four years later, the planning of the museum began, and in May 2003, The Mini Bottle Gallery opened its doors to the world, and a boyhood dream had become a reality.</p>",
        "where": "The Devil of Oslo can be found on the outside of Oslo Cathedral, just right of the main entrance. Look for the first corner facing the statue of King Christian the 4th. ",
        "address": "Kirkegata 10, 0152 Oslo",
        "category": ["museum"],
        "image": "images/minibottlegallery/minibottlegallery01.jpg",
        "galleryPath": "images/minibottlegallery",
        "galleryImages": ["minibottlegallery01.jpg", "minibottlegallery02.jpg", "minibottlegallery03.jpg", "minibottlegallery04.jpg"],
        "tags": ["museum", "gallery"],
        "homepage": "https://www.minibottlegallery.com",
        "secretLevel": "4",
        "latitude": 59.909685,
        "longitude": 10.743352,
        "favorite": true,
        "date": "2024-08-23"
    },
    {
        "id": 7,
        "title": "Museum of Oslo",
        "introduction": "Oslo’s own museum presents the city’s rich history through varied exhibitions. If you want to learn the history of Oslo–this is the museum to visit.",
        "description": "<p>The Museum of Oslo has been a part of Oslo Museum since 2006. It serves as the cultural history museum for Oslo and the former Aker district. The museum was founded on December 22, 1905, as the association 'Det gamle Christiania.' The initiative was led by architect Fritz Holland, who remained in charge until 1912. The museum is located at Frogner Manor in Frogner Park, where the first exhibitions were opened in the main building in 1909. In the 1980s, the east wing of the estate was developed for the Museum of Oslo's permanent city history exhibitions. In 2000, the museum's new administration building was completed on the east side of the estate, and the west wing was utilized in 2003 for temporary exhibitions. In its final year as an independent museum, Oslo City Museum had a total of 90,117 visitors.</p><p>Until the end of 2005, the Museum of Oslo was still organized as a private association but was primarily funded by public grants from Oslo Municipality and the state. The association was dissolved by decision of the general assembly on its centennial, December 22, 2005. At the same time, it was decided to establish a foundation to manage the ownership of the collections and a friends' association to represent the interests of its members. From January 1, 2006, the Museum of Oslo became part of the new foundation Oslo Museum, which took over operational responsibility. The new museum foundation initially operated under the working title 'Hovedstadsmuseet,' but since December 2006, it has been known as Oslo Museum. The Museum of Oslo, the Intercultural Museum (IKM), and the Theatre Museum joined forces to establish the new museum as a consequence of the national museum reform. For the time being, the three former entities continued to operate from their previous locations.</p><p>The Museum of Oslo has satellite exhibitions in workers' housing at Tøyen and Sagene. In 2008, it also opened the exhibition 'Christiania 1624 - 1850' in the Old Town Hall, but this had to be discontinued in 2010 due to financial constraints that forced the museum to terminate the lease with Oslo Municipality. The museum manages events and city walks under the 'Know Your City' program and publishes the journal Byminner (started in 1955). The collections include all types of objects related to the city's history and the lives and activities of its inhabitants. Particularly valuable are the Museum of Oslo's art collection and photo collection featuring Oslo scenes and portraits. The photo collection is one of the largest in the country and documents the city's development from the early days of photography to the present. In 2010, Oslo Museum, in collaboration with Oslo City Archives, launched the website oslobilder.no, offering searchable access to the digitized parts of the photo collections from both institutions.</p>",
        "where": "The museum can be found in Frognerparken close to Frogner Manor House with its glorious halls and interiors from circa 1750–1900.",
        "address": "Frognerveien 67, 0266 Oslo",
        "category": ["museum"],
        "image": "images/museumofoslo/museumofoslo01.jpg",
        "galleryPath": "images/museumofoslo",
        "galleryImages": ["museumofoslo01.jpg", "museumofoslo02.jpg", "museumofoslo03.jpg", "museumofoslo04.jpg"],
        "tags": ["local history", "city"],
        "homepage": "",
        "secretLevel": "2",
        "latitude": 59.923911,
        "longitude": 10.702611,
        "favorite": true,
        "date": "2024-08-24"
    },
    {
        "id": 8,
        "title": "WW2 Graffiti: Be True to H7",
        "introduction": "A graffiti to support the Norwgian king Haakon VII made during the Second World War still stands today.",
        "description": "<p>In Uranienborgveien, there is a rare piece of graffiti dating back to World War II. During the occupation, a daring resistance fighter took some paint and wrote 'Vær tro mot H7' (Be true to H7) on the rock on the west side—right outside the premises where the Hirden (Nazi paramilitary organization) was based. H7, of course, refers to Haakon VII, who was the King of Norway from 1905 to 1957. Anyone who has seen the film “The King's Choice” knows the tough challenge Haakon VII faced when the Germans invaded Norway on April 9, 1940. This man gave his full support to the king and risked his life to show it on the rock. The rock cutting has been kept open and has been protected because it showcases the type of bedrock typical of Oslo. What you can see is shale with limestone nodules—whatever that might be. The graffiti piece is now preserved with a piece of plexiglass in front of it. None other than resistance hero Gunnar “Kjakan” Sønsteby was present to cut the ribbon when this was put in place.</p>",
        "where": "The graffiti can be found in Uranienborgveien just nest to Uraniensborg Park.",
        "address": "Uranienborgveien, 0258 Oslo",
        "category": ["monument", "graffiti"],
        "image": "images/ww2graffitibetruetoh7/ww2graffitibetruetoh701.jpg",
        "galleryPath": "images/ww2graffitibetruetoh7",
        "galleryImages": ["ww2graffitibetruetoh701.jpg", "ww2graffitibetruetoh702.jpg"],
        "tags": ["local history", "graffiti", "ww2", "war"],
        "homepage": "",
        "secretLevel": "8",
        "latitude": 59.922214,
        "longitude": 10.721665,
        "favorite": true,
        "date": "2024-08-25"
    },
    {
        "id": 9,
        "title": "The Powder Tower",
        "introduction": "The Powder Tower was converted into a prison intended to hold the most dangerous and worst criminals.",
        "description": "<p>The Powder Tower, also known as the Powder House, was originally the tower where gunpowder was stored from 1755 onward. In 1830, the Powder Tower was converted into a prison intended to hold the most dangerous and worst criminals. As a result, we have some fantastic stories from the Powder Tower, and there are four prisoners, in particular, I want to highlight. Most intriguing, however, is the murder in the Powder Tower and the weapon that remains there to this day. But more on that later.</p><p>We begin with Gjest Baardsen—a gentleman criminal and escape artist. He is best known for his numerous jailbreaks, outsmarting sheriffs and bailiffs, and his many travels around the country. He gained a reputation as a Norwegian Robin Hood who fought against the injustices of those in power. In 1827, he was sentenced to life at hard labor and was confined in the Powder Tower. While there, he wrote his autobiography, which perhaps explains why the stories about him today seem so noble. A film about his life was made in 1939, and it remains quite good even today.</p><p>Next is Ole Høiland, a master thief and Casanova. He became somewhat of a folk hero, as he also played a bit of the Robin Hood role and was sympathetic toward ordinary people. He is best known as the only person to successfully rob Norges Bank, and he escaped from prison a total of 13 times. He eventually ended up in the Powder Tower—where he actually managed to escape. He sawed through the floor and dug his way through the ground beneath the walls, very much in a Dalton-style. He did the digging naked because he couldn’t afford to get dirt on his clothes, as that would have raised suspicion. But after three years, he was captured again, betrayed by those who were hiding him, and ended up back in the Powder Tower. There, he was put on display every Sunday in his chains as a warning of what could happen if you became a criminal. In the end, he took his own life by hanging himself in the Powder Tower. His life was portrayed in the Norwegian feature film 'Balladen om mestertyven Ole Høiland' from 1970.</p><p>Most people know Vidkun Quisling, the traitor whose surname has become synonymous with the words “traitor” and “Judas.” After the liberation of Norway, Quisling was convicted in 1945 for treason, murder, and theft in the Eidsivating Court of Appeal. He ended up in the Powder Tower. Not long after, he was executed at the execution site in Akershus Fortress. This was done in the dead of night in silence because they did not want to make him a martyr. They just wanted to get rid of him, and that they did.</p><p>The last one is the robber-murderer Rudolf Hansen. He is not as well-known as the other three I mentioned, but his story in the Powder Tower is the most thrilling of all. A brutal event involving him occurred in the Powder Tower. He was a robber and murderer, which is why he ended up there. One day, he decided to escape. He crafted a weapon from one of the bed legs, to which he attached large nails and a pair of scissors he had managed to smuggle in from the Slave Prison. The scissors were attached to provide the right weight for the weapon. He beat one of the guards to death in the Powder Tower. The guard’s life could not be saved. Hjalmar Hansen, a large guard who was standing outside the Powder Tower, heard the screams from inside and ran in. Rudolf was put in chains and later placed in 'the pit,' where he ended his life by hanging himself. The homemade murder weapon can still be seen in the Powder Tower today, and you can only imagine the bloody murder deep within the Powder Tower when you see the weapon.</p>",
        "where": "The Powder Tower can be found inside the walls of Akershus Fortress.",
        "address": "Akershus festning, 0150 Oslo",
        "category": ["history", "prison"],
        "image": "images/thepowdertower/thepowdertower01.jpg",
        "galleryPath": "images/thepowdertower",
        "galleryImages": ["thepowdertower01.jpg", "thepowdertower02.jpg", "thepowdertower03.jpg", "thepowdertower04.jpg", "thepowdertower05.jpg", "thepowdertower06.jpg", "thepowdertower07.jpg", "thepowdertower08.jpg", "thepowdertower09.jpg", "thepowdertower10.jpg", "thepowdertower11.jpg", "thepowdertower12.png"],
        "tags": ["local history", "prison"],
        "homepage": "",
        "secretLevel": "5",
        "latitude": 59.907966,
        "longitude": 10.738691,
        "favorite": true,
        "date": "2024-08-26"
    },
    {
        "id": 10,
        "title": "Restaurant Schrøder: Harry Hole's Favorite Restaurant",
        "introduction": "Restaurant Schrøder is a classic pub and restaurant an old-fashioned style with paintings from the 1920s at St. Hanshaugen with traditional Norwegian food on the menu and a relaxed atmosphere that attracts a good mix of regulars, locals and visitors. One of locals is the famous detective Harry Hole.",
        "description": "<p>Nestled in the heart of St. Hanshaugen at Waldemar Thranes gate 8, Restaurant Schrøder is one of Oslo's last-standing traditional eateries—a true gem that has resisted time and trends. With its cozy, relaxed atmosphere, Schrøder is a meeting place for a diverse crowd: loyal regulars, neighborhood locals, and curious newcomers who seek a slice of Oslo’s storied past.</p><p>From the outside, Schrøder might not catch your eye with its modest facade, but step inside and you'll be transported back in time. The walls are adorned with striking paintings by Sigurd Fosnes from the 1920s, capturing nostalgic scenes of old Oslo, including Gamle Aker, Enerhaugen, and Torggata. Among these artworks is a special painting that features Restaurant Schrøder’s original location at Torggata 14, offering a glimpse into its roots.</p><p>The restaurant’s history dates back to 1925 when Hans Schrøder took over Elise Pettersen’s café, which had been a beloved local spot since 1912. Originally situated at the corner of Torggata and Henrik Ibsens gate, just a stone's throw from Youngstorget, the restaurant was forced to move when the building was demolished in 1954 to make way for the new Folkets Hus. In 1956, Schrøder reopened in a new building at its current location, which itself has a rich history, having housed restaurants since 1900.</p><p>But Schrøder is more than just a restaurant; it’s a literary landmark, immortalized in Jo Nesbø’s world-famous crime novels featuring the hard-boiled detective Harry Hole. Schrøder serves as Harry's favorite haunt, a place where he nurses his troubles with a drink, sinking into the comfort of its old wooden tables and dim lighting. It’s in these familiar surroundings that Harry Hole contemplates his next move, grapples with personal demons, and unwinds after chasing down Oslo’s most sinister criminals. The restaurant’s atmosphere, steeped in history and character, makes it the perfect backdrop for Harry’s gritty world.</p><p>Schrøder’s connection to Harry Hole and Jo Nesbø reached a new height in 2016 when Hollywood came knocking to film scenes from Nesbø’s thriller “The Snowman” right in the restaurant. This iconic location, with its vintage charm and storied walls, provided an authentic slice of Oslo life, forever linking it to the cinematic adaptation of Nesbø’s dark and gripping universe.</p><p>So whether you’re a die-hard fan of Jo Nesbø’s novels, a lover of classic Norwegian cuisine, or simply someone who appreciates the allure of a bygone era, Restaurant Schrøder offers a unique experience that’s as much about soaking in the atmosphere as it is about the food. Here, you’re not just dining; you’re stepping into the pages of Oslo’s literary and cultural history.</p>",
        "where": "Restaurant Schrøder can be found at St. Haunshaugen, not far from the park.",
        "address": "Waldemar Thranes gate 8, 0171 Oslo",
        "category": ["restaurant"],
        "image": "images/schroder/schroder01.jpg",
        "galleryPath": "images/schroder",
        "galleryImages": ["schroder01.jpg", "schroder02.jpg", "schroder03.jpg", "schroder04.jpg", "schroder05.jpg", "schroder06.jpg"],
        "tags": ["local history", "food", "restraurant", "harry hole"],
        "homepage": "https://www.restaurant-schrøder.no",
        "secretLevel": "2",
        "latitude": 59.923416,
        "longitude": 10.739474,
        "favorite": true,
        "date": "2024-08-27"
    },
    {
        "id": 11,
        "title": "Den Glade Gris",
        "introduction": "Den Glade Gris is a unique dining experience in the heart of Oslo, specializing in dishes made from pork, with their signature slow-roasted pork knuckle.",
        "description": "<p>Welcome to a distinctive culinary experience in the heart of Oslo! Den Glade Gris specializes in dishes made from pork, with the house specialty being the slow-roasted pork knuckle. The restaurant embraces the slow-cooking method, marinating and roasting their dishes over several days to ensure maximum flavor and incredibly tender meat.</p><p>Den Glade Gris offers hearty Norwegian cuisine presented in an honest and rustic style. The restaurant collaborates with breweries from across the country, resulting in a wide selection of beers. Service is friendly and informal, delivered with a humorous touch. Every day, they prepare two lunch soups using surplus ingredients from the previous day, promoting sustainability.</p><p>The restaurant takes pride in using pork from well-cared-for pigs, ensuring the meat is succulent and flavorful. They source their meat from Krosby Kjøtt in Oslo, which works with reputable Norwegian farmers. One of their key suppliers, Jan Bredo Våland, has been a pig farmer in Jæren for over 40 years, raising around 2,100 pigs annually. His farm adheres to stringent animal welfare standards, including daily inspections of each pig and a maximum transport time of one hour to the slaughterhouse, exceeding Norwegian regulatory requirements.</p><p>At Våland, pigs live comfortably for their 6-7 month lifespan, with heated floors for the youngest pigs and excellent ventilation. Each pen includes a plastic ball for the pigs to play with, though they are generally content to lounge together in their pen. Their specially formulated feed keeps them healthy and thriving. Disease prevention is a top priority, and strict biosecurity measures are in place, including the use of full protective suits for visitors entering the barn.</p><p>Den Glade Gris is proud to source their meat from dedicated farmers like Jan Bredo Våland, who ensure high standards of animal welfare and quality.</p>",
        "where": "Located centrally in Oslo, Den Glade Gris is the perfect spot to enjoy authentic Norwegian pork dishes with a rustic twist.",
        "address": "St. Olavs Gate 33, 0166 Oslo",
        "category": ["restaurant"],
        "image": "images/dengladegris/dengladegris01.jpg",
        "galleryPath": "images/dengladegris",
        "galleryImages": ["dengladegris01.jpg", "dengladegris02.jpg", "dengladegris03.jpg"],
        "tags": ["restaurant", "food"],
        "homepage": "https://www.dengladegris.no/",
        "secretLevel": "3",
        "latitude": 59.917831,
        "longitude": 10.733562,
        "favorite": true,
        "date": "2024-08-28"
    },
    {
        "id": 12,
        "title": "The Cannonball on the Wall",
        "introduction": "The Swedish King Charles XII attacked Oslo in 1716. Cannoballs were shot towards the Swedish army, and one can still be seen today.",
        "description": "<p>We go back to 1716 when the Swedish King Charles XII attacked Oslo, or Kristiania as it was called then, with 7,000 men. The Swedes advanced through Ås and continued over the ice on Bunnefjorden, as the roads towards Kristiania had been blocked. On March 21, they reached Kristiania, but Norway fired cannons at the Swedes, causing the ice to crack. The Swedes landed on Bleikøya, Hovedøya, and Nakkholmen. The forces eventually landed on Bygdøy and then moved across Frognerkilen towards Gamle Aker Church. By that time, Kristiania had been evacuated. Only Akershus Fortress stood against the Swedish attack, doing everything it could to send the Swedes back where they came from. After a month of siege, the Swedes were forced to retreat in defeat.</p><p>One of the cannonballs fired at the Swedes from Akershus Fortress ended up embedded in the wall of the Departementsgården building. When Departementsgården was demolished in 1914 to make way for Oslo's new main post office, the cannonball was preserved and embedded into the wall of the new building. You can still see it there today.</p><p>And what happened to the power-hungry Swedish King Charles XII? He tried again two years later, now with 40,000 men, against Fredriksten Fortress in Halden. As he peeked up from the moat, he was hit in the head by a bullet and died at just 36 years old. Charles XII became king at the age of fifteen and spent most of his reign waging wars. It is said that it was a Swedish bullet that killed him at Fredriksten Fortress, as the Swedes were tired of his constant warfare. However, in Myking on the west coast of Norway, Jo Vedlo Hodne has been credited with the fatal shot, and a monument has been erected in his memory.</p><p>The Swedish king has also been popularized in modern culture, such as in <em>Brødrene Dal og mysteriet med Karl XIIs gamasjer</em> and Sabaton's concept album <em>Carolus Rex</em>. You can also see him in many films, including the six-hour long <em>Karl XII</em> from 1925. But best of all, you can see an actual cannonball from the war against Charles XII in the wall of the old post office!</p>",
        "where": "The cannoball can be found on the south-east side of the old Oslo Main Post Office. Look up about ten meters.",
        "address": "Dronningens gt. 15, 0152 Oslo",
        "category": ["monument", "history"],
        "image": "images/cannonball/cannonball01.jpg",
        "galleryPath": "images/cannonball",
        "galleryImages": ["cannonball01.jpg", "cannonball02.jpg", "cannonball03.jpg"],
        "tags": ["war", "war monument"],
        "homepage": "",
        "secretLevel": "8",
        "latitude": 59.910106,
        "longitude": 10.745901,
        "favorite": true,
        "date": "2024-08-29"
    },
    {
        "id": 13,
        "title": "Ekeberg Sculpture Park",
        "introduction": "Ekeberg Sculpture Park is a stunning open-air museum in Oslo, blending contemporary art with breathtaking views of the city and its natural surroundings.",
        "description": "<p>Nestled on the hills overlooking Oslo, Ekeberg Sculpture Park is a must-visit destination for art enthusiasts, nature lovers, and those seeking a peaceful escape from the city. This unique open-air museum combines stunning sculptures with breathtaking views of the Norwegian capital, making it one of Oslo’s most captivating attractions.</p><p>Ekeberg Sculpture Park is home to an impressive collection of contemporary art, featuring works by renowned artists such as Salvador Dalí, Louise Bourgeois, and Damien Hirst, among others. The sculptures are thoughtfully placed throughout the park, creating a seamless blend of art and nature. As you wander through the wooded trails and open spaces, you’ll encounter over 40 sculptures, each offering a unique perspective and interaction with the surrounding landscape.</p><p>A Rich Cultural and Historical Setting: Beyond the art, Ekeberg Park is steeped in history. The area has been inhabited since the Stone Age, and you can still find ancient petroglyphs and traces of Oslo's past scattered throughout the park. Information boards along the paths provide insights into the historical significance of the area, making your visit both an artistic and educational experience.</p><p>One of the highlights of Ekeberg Sculpture Park is the panoramic view of Oslo and the Oslofjord. The park’s elevated position offers stunning vistas of the city skyline, the fjord, and the surrounding forests. It’s an ideal spot for photography or simply to relax and take in the beautiful scenery.</p><p>A Perfect Escape for All Seasons: Ekeberg Sculpture Park is open year-round, with each season offering a different experience. In the spring and summer, the park is lush and green, providing a vibrant backdrop for the sculptures. Autumn brings a burst of colors with the changing leaves, while winter adds a serene, snowy landscape that transforms the park into a winter wonderland.</p><p>Getting There: Located just a short tram ride from the city center, Ekeberg Sculpture Park is easily accessible. Take tram line 18 or 19 to Ekebergparken, and from there, it's a short walk to the entrance. The park is free to enter, making it an ideal destination for visitors looking to enjoy world-class art without the usual museum price tag.</p><p>Whether you’re a first-time visitor to Oslo or a returning traveler, Ekeberg Sculpture Park offers a unique blend of art, history, and nature that’s sure to leave a lasting impression. Explore this hidden gem and experience Oslo from a whole new perspective.</p>",
        "where": "Located on the hills above Oslo, offering stunning views of the city and Oslofjord while surrounded by contemporary sculptures.",
        "address": "Kongsveien 23, 0193 Oslo",
        "category": ["attraction", "park"],
        "image": "images/ekeberg/ekeberg01.jpg",
        "galleryPath": "images/ekeberg",
        "galleryImages": ["ekeberg01.jpg", "ekeberg02.jpg", "ekeberg03.jpg", "ekeberg04.jpg", "ekeberg05.jpg", "ekeberg06.jpg", "ekeberg07.jpg", "ekeberg08.jpg", "ekeberg09.jpg", "ekeberg10.jpg", "ekeberg11.jpg"],
        "tags": ["sculpture", "art", "park", "outdoors"],
        "homepage": "https://www.ekebergparken.com/",
        "secretLevel": "1",
        "latitude": 59.898328,
        "longitude": 10.759695,
        "favorite": true,
        "date": "2024-08-30"
    },
    {
        "id": 14,
        "title": "Vigeland Sculpture Park",
        "introduction": "Vigeland Sculpture Park is the world's largest sculpture park dedicated to a single artist, showcasing the life’s work of Gustav Vigeland in Oslo.",
        "description": "<p>Located within Frogner Park in Oslo, Vigeland Sculpture Park is a must-see attraction that offers a captivating journey through the artistic vision of Norwegian sculptor Gustav Vigeland. The park is the world's largest sculpture park dedicated to a single artist, featuring over 200 sculptures in bronze, granite, and wrought iron, each reflecting Vigeland's exploration of human emotions and experiences.</p><p>Art in Every Corner: Vigeland’s sculptures depict a wide range of human conditions—joy, sadness, love, and struggle—captured in expressive and sometimes provocative forms. The park's centerpiece, the towering Monolith, stands 14 meters tall and is carved from a single granite block, symbolizing the cycle of life and human aspirations. Surrounding it are numerous figures, each meticulously crafted to convey deep emotion and narrative.</p><p>The Iconic Sinnataggen: Among the park’s most famous sculptures is the Sinnataggen, or Angry Boy, a small but powerful figure that has become one of Oslo’s most beloved symbols. Visitors often engage with this sculpture, adding a playful and interactive element to the park experience.</p><p>More Than Just Sculptures: Beyond the stunning artworks, Vigeland Sculpture Park is a beautiful green space with tree-lined paths, fountains, and bridges, perfect for a leisurely stroll or a relaxing picnic. The park's layout is thoughtfully designed to lead visitors through Vigeland’s works, culminating at the Monolith Plateau, which offers panoramic views of the surrounding area.</p><p>A Historical and Cultural Landmark: The park was completed between 1939 and 1949 and has since become one of Norway’s most popular tourist attractions. Vigeland himself designed the park’s layout and the architectural elements, making it a comprehensive showcase of his artistic legacy. The Vigeland Museum, located near the park, offers further insight into his life and work, with additional exhibits and information about his creative process.</p><p>Open Year-Round: Vigeland Sculpture Park is open 24 hours a day, every day of the year, and entrance is free, making it an accessible and unmissable part of any visit to Oslo. Whether you visit during the lush summer months, when the park is in full bloom, or in the serene winter snow, Vigeland’s sculptures offer a timeless reflection on the human experience.</p><p>Getting There: The park is easily accessible by tram or bus from the city center. Take tram line 12 to Vigelandsparken or bus lines 20, 28, or 30 to Frogner Park. The park is a short walk from the stops and is also accessible by bike or on foot for those exploring the city’s neighborhoods.</p><p>Visitor Tips: Don’t forget your camera—there are countless photo opportunities throughout the park. Wear comfortable shoes to explore the expansive grounds fully, and consider visiting the nearby Vigeland Museum for a deeper dive into the artist’s work. Vigeland Sculpture Park is not just a place to see art; it's a place to experience the breadth of human emotion in a serene and inspiring setting.</p>",
        "where": "Located in Frogner Park, offering a serene environment filled with sculptures that reflect the range of human emotion and experiences.",
        "address": "Nobels gate 32, 0268 Oslo",
        "category": ["attraction", "park"],
        "image": "images/vigeland/vigeland01.jpg",
        "galleryPath": "images/vigeland",
        "galleryImages": ["vigeland01.jpg", "vigeland02.jpg", "vigeland03.jpg", "vigeland04.jpg", "vigeland05.jpg", "vigeland06.jpg", "vigeland07.jpg", "vigeland08.jpg"],
        "tags": ["sculpture", "art", "park", "outdoors"],
        "homepage": "https://www.vigeland.museum.no/en/vigeland-park",
        "secretLevel": "1",
        "latitude": 59.927118,
        "longitude": 10.699511,
        "favorite": true,
        "date": "2024-08-31"
    },
    {
        "id": 15,
        "title": "Emanuel Vigeland Museum",
        "introduction": "The Emanuel Vigeland Museum is one of Oslo’s hidden treasures, known for its mysterious and captivating Tomba Emmanuelle, an extraordinary mausoleum covered in frescoes.",
        "description": "<p>Tucked away in the residential area of Slemdal, the Emanuel Vigeland Museum is a true hidden gem of Oslo. This unique museum, built by the lesser-known brother of Gustav Vigeland, offers an intriguing and unforgettable experience that stands in stark contrast to the bustling city. Emanuel Vigeland’s Tomba Emmanuelle, the museum’s main attraction, is a dark and atmospheric mausoleum covered from floor to ceiling with stunning frescoes that explore themes of life, death, and eroticism.</p><p>The Mysterious Tomba Emmanuelle: The mausoleum is a dimly lit, barrel-vaulted space that creates an intense and contemplative atmosphere. The walls and ceiling are adorned with Emanuel Vigeland’s massive fresco, <em>Vita</em>, which depicts the cycle of human life in vivid and dramatic scenes. The entrance to the mausoleum is deliberately low, requiring visitors to bow as they enter, emphasizing humility and respect in the face of the profound art within.</p><p>A Unique Artistic Experience: Unlike any other museum in Oslo, the Emanuel Vigeland Museum is an immersive and personal reflection of the artist’s fascination with existential themes. The acoustics inside the mausoleum are incredible, amplifying every sound and adding to the sense of awe. Many visitors are struck by the museum’s haunting beauty and the deeply emotional journey it evokes.</p><p>More Than Just a Museum: The Emanuel Vigeland Museum is also the final resting place of Emanuel himself, whose ashes are interred above the entrance, behind a stone slab marked with his name. This unique aspect makes the museum not just an art space but a deeply personal monument to the artist’s life and vision.</p><p>Getting There: The museum is located in the Slemdal area of Oslo, a short bus or tram ride from the city center. Take bus line 46 to Slemdal or tram line 1 to the Slemdal stop, followed by a short walk. Due to the intimate size of the museum, it's recommended to check opening hours in advance as they are limited, typically open on Sundays or by appointment.</p><p>Visitor Tips: Be prepared for a one-of-a-kind experience that differs greatly from traditional museums. The dim lighting and powerful artwork create a reflective environment, so allow yourself time to fully absorb the space. Photography is not permitted inside the mausoleum, so take the opportunity to experience the art in the moment. The Emanuel Vigeland Museum offers a profound journey into the depths of human existence, making it a must-visit for those seeking something truly unique in Oslo.</p>",
        "where": "Located in the Slemdal area of Oslo, offering an intense and contemplative art experience inside the unique Tomba Emmanuelle mausoleum.",
        "address": "Grimelundsveien 8, 0775 Oslo",
        "category": ["museum"],
        "image": "images/emanuelvigeland/emanuelvigeland01.jpg",
        "galleryPath": "images/emanuelvigeland",
        "galleryImages": ["emanuelvigeland01.jpg", "emanuelvigeland02.jpg", "emanuelvigeland03.jpg"],
        "tags": ["museum", "art", "mausoleum", "hidden gem"],
        "homepage": "https://www.emanuelvigeland.museum.no/",
        "secretLevel": "8",
        "latitude": 59.943888,
        "longitude": 10.7025,
        "favorite": true,
        "date": "2024-09-01"
    },
    {
        "id": 16,
        "title": "Grand Café",
        "introduction": "Grand Café is a historic restaurant located on Karl Johans gate in Oslo, known for its elegant atmosphere, rich history, and association with famous Norwegian cultural figures.",
        "description": "<p>Located at the iconic Grand Hotel on Oslo’s main street, Karl Johans gate, Grand Café is one of the city’s most famous and storied restaurants. Established in 1874, it quickly became a popular meeting place for the city’s elite, artists, writers, and intellectuals. Its elegant decor and rich history make it a must-visit for anyone looking to dine where some of Norway’s greatest cultural figures once gathered.</p><p>A Meeting Place for Legends: Grand Café was a favorite haunt of renowned Norwegian playwright Henrik Ibsen, who famously dined here almost every day. Other notable figures such as Edvard Munch, Knut Hamsun, and Fridtjof Nansen were also regular guests. The restaurant’s walls are adorned with paintings and portraits that pay tribute to these literary and artistic giants, including Per Krohg’s famous mural depicting many of these illustrious patrons.</p><p>Modern Elegance with a Touch of History: After a major renovation, Grand Café now combines modern elegance with its historic charm. The interior retains classic elements, such as its large arched windows and beautiful wooden panels, while also offering contemporary touches that create a sophisticated dining experience. The restaurant serves a menu inspired by Nordic and European cuisine, featuring seasonal ingredients and a selection of fine wines.</p><p>A Taste of Norwegian Tradition: Grand Café is not just about the ambiance; it’s also a culinary destination that offers a taste of traditional Norwegian dishes with a modern twist. Whether you’re stopping by for a classic afternoon tea, a light lunch, or an indulgent dinner, the café provides an exceptional dining experience that honors its storied past while embracing the present.</p><p>Perfect for Every Occasion: Grand Café is open daily for breakfast, lunch, and dinner, making it a versatile spot for any occasion. Whether you’re celebrating a special event, enjoying a meal with friends, or simply soaking in the atmosphere of Oslo’s rich cultural history, Grand Café offers the perfect setting.</p><p>Getting There: Located in the heart of Oslo, Grand Café is easily accessible by foot, tram, or bus from anywhere in the city center. It is situated on Karl Johans gate, directly opposite the Norwegian Parliament and just a short walk from the Royal Palace.</p><p>Visitor Tips: Make a reservation in advance, especially if you plan to visit during peak dining hours. Be sure to take a moment to admire the artwork and soak in the historic ambiance that has made Grand Café a beloved institution in Oslo for nearly 150 years. Whether you're a history buff, a foodie, or just looking for a unique dining experience, Grand Café is an essential stop on your Oslo itinerary.</p>",
        "where": "Located on Oslo’s main street, Karl Johans gate, offering a blend of modern elegance and rich history in the heart of the city.",
        "address": "Karl Johans gate 31, 0159 Oslo",
        "category": ["restaurant"],
        "image": "images/grandcafe/grandcafe01.jpg",
        "galleryPath": "images/grandcafe",
        "galleryImages": ["grandcafe01.jpg"],
        "tags": ["restaurant", "historic", "café", "Norwegian cuisine"],
        "homepage": "https://www.grandcafeoslo.no/",
        "secretLevel": "2",
        "latitude": 59.913751,
        "longitude": 10.738028,
        "favorite": true,
        "date": "2024-09-02"
    },
    {
        "id": 17,
        "title": "Neseblod Records",
        "introduction": "Neseblod Records is a legendary record store in Oslo, renowned worldwide as the ultimate destination for black metal fans, offering rare and unique collections of metal music, memorabilia, and merchandise.",
        "description": "<p>Neseblod Records, located in the historic neighborhood of Aker Brygge in Oslo, is more than just a record store—it’s a shrine to the black metal scene. Known globally among metal enthusiasts, Neseblod is the go-to place for rare vinyl, CDs, tapes, and an impressive array of black metal memorabilia. Whether you’re a die-hard fan or simply curious about the genre, a visit to Neseblod Records is a unique experience that dives deep into the heart of Norway’s extreme music culture.</p><p>A Rich History in Black Metal: Neseblod Records occupies the space that was once home to Helvete, the infamous black metal shop and hangout spot founded by Euronymous of Mayhem in the early 1990s. Today, Neseblod carries on the legacy, preserving a piece of black metal history within its walls. The store has become a pilgrimage site for fans who come to Oslo specifically to see where it all began.</p><p>An Extensive Collection: Neseblod Records boasts one of the most extensive collections of black metal music in the world, featuring both classic releases and obscure finds that are often unavailable elsewhere. Beyond music, the shop is filled with posters, fanzines, clothing, and various artifacts that paint a vivid picture of the genre’s evolution. For collectors and casual listeners alike, Neseblod offers a chance to discover rare gems and connect with the roots of black metal.</p><p>A Fascinating Atmosphere: Walking into Neseblod Records feels like stepping into another world. The store’s dark, cavernous interior, adorned with black metal artwork and paraphernalia, sets the tone for an immersive experience. It’s not just a shop; it’s a place where the past and present of black metal culture coexist, making it a must-visit for anyone interested in Oslo’s musical heritage.</p><p>Beyond the Store: Neseblod is more than just a retail space; it also hosts events, exhibitions, and listening sessions that celebrate black metal’s enduring influence. The store’s staff are knowledgeable and passionate about the genre, always ready to help visitors explore the vast collection or share stories about the history of black metal.</p><p>Visitor Tips: If you’re planning to visit, be sure to set aside some time to browse the extensive collection—it’s easy to get lost in the vast array of music and memorabilia. Photography inside the store is often permitted, but be respectful of other visitors and the space. Whether you're hunting for a specific album or simply soaking in the atmosphere, Neseblod Records offers an unforgettable glimpse into the world of black metal.</p>",
        "where": "Located in the east side area of Oslo, Neseblod Records is the ultimate destination for black metal fans seeking rare music and memorabilia.",
        "address": "Schweigaards gate 56, 0656 Oslo",
        "category": ["store"],
        "image": "images/neseblod/neseblod01.jpg",
        "galleryPath": "images/neseblod",
        "galleryImages": ["neseblod01.jpg"],
        "tags": ["record store", "black metal", "music", "memorabilia"],
        "homepage": "http://www.neseblodrecords.com/",
        "secretLevel": "4",
        "latitude": 59.908391,
        "longitude": 10.769544,
        "favorite": true,
        "date": "2024-09-03"
    },
    {
        "id": 18,
        "title": "Ekeberg Petroglyphs",
        "introduction": "The Ekeberg Petroglyphs are ancient rock carvings located in Ekeberg, Oslo, offering a fascinating glimpse into the lives and beliefs of Norway's early inhabitants.",
        "description": "<p>Located within the scenic Ekeberg area, the Ekeberg Petroglyphs are one of Oslo’s most intriguing historical sites, showcasing rock carvings that date back to the Stone Age, around 4,000 to 5,000 years ago. These ancient artworks offer a unique window into the past, depicting scenes from everyday life, hunting, and spiritual beliefs of Norway’s early inhabitants.</p><p>The petroglyphs at Ekeberg feature a variety of motifs, including animals like elk and reindeer, human figures, and geometric patterns. These carvings provide valuable insights into the lives of people who lived in the Oslo area thousands of years ago. As you explore the site, you can imagine the rituals, storytelling, and daily activities that these ancient carvings might represent.</p><p>Preserved History in Nature: The Ekeberg Petroglyphs are nestled within a beautiful natural setting, surrounded by lush forests and scenic trails that offer stunning views of Oslo and the fjord. Visiting the petroglyphs provides not only an opportunity to see these incredible ancient artworks but also a chance to enjoy a peaceful walk in one of Oslo’s most picturesque parks.</p><p>Easy Accessibility: The petroglyphs are easily accessible via marked paths in Ekeberg Park, with information boards providing context and details about the carvings. The site is open to the public year-round and is free to visit, making it an ideal stop for those interested in history, archaeology, or simply looking to explore the outdoors in Oslo.</p><p>Getting There: Ekeberg Petroglyphs are located in Ekeberg Park, which is easily accessible from the city center. Take tram lines 18 or 19 to Ekebergparken, and follow the signs and marked paths to reach the petroglyph site. The area is also reachable by car or bike, with parking available nearby.</p><p>Be respectful of the site—these carvings have survived for millennia and are protected as part of Norway’s cultural heritage. The Ekeberg Petroglyphs offer a serene and educational experience that connects visitors with Oslo’s ancient past.</p><p>Whether you're a history enthusiast, a nature lover, or just curious about Oslo’s hidden gems, the Ekeberg Petroglyphs provide a fascinating journey into the distant past that’s well worth exploring.</p>",
        "where": "Located close to Ekeberg Park, Oslo, offering a unique historical and cultural experience in a beautiful natural setting.",
        "address": "Ekebergveien, 0196 Oslo",
        "category": ["historical site", "history"],
        "image": "images/ekebergpetroglyphs/ekebergpetroglyphs01.jpg",
        "galleryPath": "images/ekebergpetroglyphs",
        "galleryImages": ["ekebergpetroglyphs01.jpg", "ekebergpetroglyphs02.jpg", "ekebergpetroglyphs03.jpg", "ekebergpetroglyphs04.jpg", "ekebergpetroglyphs05.jpg"],
        "tags": ["petroglyphs", "rock carvings", "history", "outdoors"],
        "homepage": "",
        "secretLevel": "2",
        "latitude": 59.897419,
        "longitude": 10.759970,
        "favorite": true,
        "date": "2024-09-04"
    },
    {
        "id": 19,
        "title": "Norwegian Armed Forces Museum (Forsvarsmuseet)",
        "introduction": "The Norwegian Armed Forces Museum in Oslo offers an engaging exploration of Norway's military history, showcasing artifacts, exhibits, and stories from Viking times to the modern day.",
        "description": "<p>Located within the historic Akershus Fortress in Oslo, the Norwegian Armed Forces Museum (Forsvarsmuseet) provides a comprehensive look at the military history of Norway. From the Viking Age through the Middle Ages, the Napoleonic Wars, and the pivotal moments of World War II, the museum covers a broad timeline that highlights the evolution of Norway’s armed forces.</p><p>Diverse Exhibits and Artifacts: The museum features a vast collection of artifacts, including weapons, uniforms, medals, and military equipment. Interactive exhibits and detailed displays bring to life the stories of Norway’s military past, illustrating the country's strategic challenges and triumphs through the ages. Key exhibits include Norway’s involvement in World War II, its role in the NATO alliance, and peacekeeping missions around the globe.</p><p>Highlights of the Museum: A visit to Forsvarsmuseet offers an immersive experience with highlights such as the impressive collection of cannons, the story of Norway’s resistance during World War II, and displays of Viking-era weapons. The museum also features a section dedicated to the Cold War era, showcasing Norway’s strategic position during a time of global tension.</p><p>A Historic Setting: Set within the ancient walls of Akershus Fortress, the museum itself is part of the experience. The fortress dates back to the late 13th century and has played a key role in Norway's defense for centuries. Exploring the museum gives visitors a unique opportunity to enjoy the fortress’s architecture and scenic views of Oslo’s harbor.</p><p>Family-Friendly and Educational: Forsvarsmuseet is ideal for visitors of all ages, offering educational programs, guided tours, and hands-on exhibits that engage both children and adults. The museum’s interactive displays make learning about military history accessible and enjoyable, providing a meaningful experience for school groups, families, and history buffs alike.</p><p>Getting There: The Norwegian Armed Forces Museum is conveniently located in the heart of Oslo at Akershus Fortress, easily reachable by foot from the city center. Public transport options include trams, buses, and ferries that stop near the fortress. The museum is well-signposted from the main entrance of Akershus Fortress.</p><p>Visitor Tips: Plan to spend at least an hour exploring the museum and surrounding fortress grounds. Admission to Forsvarsmuseet is free, making it an excellent addition to any Oslo itinerary. Be sure to check the museum’s website for special exhibitions and events that may be happening during your visit. Whether you’re a history enthusiast or just curious about Norway’s military past, the Norwegian Armed Forces Museum offers a fascinating and educational experience in one of Oslo’s most iconic settings.</p>",
        "where": "Located within Akershus Fortress in Oslo, offering a comprehensive view of Norway’s military history in a historic and scenic setting.",
        "address": "Akershus Festning, 0015 Oslo",
        "category": ["museum", "war"],
        "image": "images/forsvarsmuseet/forsvarsmuseet01.jpg",
        "galleryPath": "images/forsvarsmuseet",
        "galleryImages": ["forsvarsmuseet01.jpg", "forsvarsmuseet02.jpg", "forsvarsmuseet03.jpg", "forsvarsmuseet04.jpg", "forsvarsmuseet05.jpg", "forsvarsmuseet06.jpg", "forsvarsmuseet07.jpg", "forsvarsmuseet08.jpg"],
        "tags": ["museum", "history", "military", "Akershus Fortress"],
        "homepage": "https://forsvaretsmuseer.no/forsvarsmuseet",
        "secretLevel": "4",
        "latitude": 59.904465,
        "longitude": 10.740841,
        "favorite": true,
        "date": "2024-09-05"
    },
    {
        "id": 20,
        "title": "Gressholmen Kro",
        "introduction": "Gressholmen Kro is a charming island restaurant located in the Oslofjord, offering delicious food, beautiful views, and a relaxing escape from the city.",
        "description": "<p>Experience Gressholmen Kro: A Delightful Island Retreat in Oslo</p><p>Situated on the serene island of Gressholmen in the Oslofjord, Gressholmen Kro is a hidden gem that combines great food with a peaceful island atmosphere. Just a short ferry ride from downtown Oslo, the restaurant provides a perfect getaway for those looking to enjoy nature, scenic views, and a taste of local cuisine.</p><p>A Historic Location: Gressholmen Kro is located on an island rich in history. Once home to Oslo’s first airport in the early 20th century, Gressholmen has since become a beloved recreational area, known for its idyllic landscapes, walking trails, and diverse birdlife. The kro itself is set in a charming old building that exudes rustic character and warmth.</p><p>Delicious Local Cuisine: The menu at Gressholmen Kro focuses on fresh, seasonal ingredients and traditional Norwegian dishes with a modern twist. Whether you’re in the mood for freshly caught seafood, classic open-faced sandwiches, or a refreshing drink by the water, the restaurant offers a range of options to satisfy every palate. The outdoor seating area is perfect for enjoying meals while soaking up the stunning views of the Oslofjord.</p><p>A Relaxing Getaway: Gressholmen Kro is more than just a dining spot—it’s an experience. The island’s tranquil setting makes it a great place to relax, explore nature, and enjoy some downtime away from the city’s hustle and bustle. After a leisurely meal, take a walk along the island’s trails, relax on the beach, or take a dip in the fjord’s refreshing waters.</p><p>Getting There: Gressholmen Kro is easily accessible by ferry from Oslo’s Aker Brygge or Rådhusbrygge 4. The ferry ride takes around 15 minutes, offering beautiful views of the fjord along the way. Check the ferry schedules, especially during the off-season, as they can vary. The island is car-free, adding to the peaceful and unspoiled atmosphere.</p><p>Visitor Tips: Dress comfortably and bring a jacket as it can be breezy by the water. Gressholmen is ideal for a day trip, so plan to spend some time exploring the island before or after your meal. Reservations are recommended, especially during the summer months when the restaurant is popular with both locals and tourists. Whether you're visiting for a relaxing lunch, a special dinner, or simply a drink with a view, Gressholmen Kro offers an unforgettable island experience.</p>",
        "where": "Located on Gressholmen Island in the Oslofjord, providing a tranquil dining experience surrounded by nature.",
        "address": "Gressholmen, 0150 Oslo",
        "category": ["restaurant"],
        "image": "images/gressholmenkro/gressholmenkro01.jpg",
        "galleryPath": "images/gressholmenkro",
        "galleryImages": ["gressholmenkro01.jpg"],
        "tags": ["restaurant", "island", "fjord", "outdoors"],
        "homepage": "https://www.gressholmenkro.no/",
        "secretLevel": "3",
        "latitude": 59.884107,
        "longitude": 10.722183,
        "favorite": true,
        "date": "2024-09-06"
    },
    {
        "id": 21,
        "title": "Peststøtten (The Plague Monument)",
        "introduction": "Peststøtten is Oslo's oldest public monument, a limestone grave pillar with a cross on top, unveiled in 1654 commemorating the victims of the bubonic plague that struck the city in the 17th century, offering a solemn reminder of Oslo's past.",
        "description": "<p>Peststøtten, or The Plague Monument, stands as a poignant memorial in Oslo, dedicated to the victims of the bubonic plague that ravaged the city in 1654. Erected in 1654, the monument is located in the Gamlebyen (Old Town) area of Oslo and serves as a reminder of the devastating impact the plague had on the population, claiming the lives of thousands of residents during one of the city's darkest periods.</p><p>A Historical Symbol: The monument, made of granite, features a simple but powerful design with an inscription that commemorates those who lost their lives to the plague. The stone pillar, topped with a copper sphere, symbolizes both a marker of death and a beacon of hope, standing as a testament to the resilience of the city's inhabitants who survived the outbreak.</p><p>Location and Setting: Peststøtten is situated in a small park in Gamlebyen, surrounded by trees and greenery, offering a quiet space for reflection and remembrance. The monument's location in Old Town connects it to other historical sites, providing a deeper context of Oslo’s rich and often tumultuous past. Nearby, visitors can explore the ruins of Oslo's medieval churches and the remains of the original city, which provide further insight into the lives of those who lived through the plague.</p><p>Visiting Peststøtten: Visiting Peststøtten is an opportunity to reflect on a pivotal chapter in Oslo’s history. The monument is accessible year-round and free to visit, making it a meaningful stop for history enthusiasts, students, and anyone interested in the stories that have shaped Oslo. Information plaques near the monument provide additional historical context, making it an educational experience as well.</p><p>Getting There: Peststøtten is located in Gamlebyen, easily accessible by public transportation. Take tram lines 18 or 19 to the Gamlebyen stop, or bus lines 32 or 34, which bring you close to the site. The area is also within walking distance from Oslo's central districts, allowing visitors to explore the historical landmarks of Old Town on foot.</p><p>Visitor Tips: Bring a guidebook or use your smartphone to learn more about the plague’s impact on Oslo as you visit the monument. The nearby Ekeberg Park offers additional walking trails and scenic views of the city, making it a great way to extend your historical exploration with some natural beauty. Peststøtten may be small, but it holds a significant place in Oslo’s heritage, reminding visitors of the city's ability to endure through the most challenging times.</p>",
        "where": "Located in Gamlebyen (Old Town), Oslo, surrounded by a peaceful park setting, commemorating the victims of the bubonic plague.",
        "address": "Skråninga, 0654 Oslo",
        "category": ["monument"],
        "image": "images/peststotten/peststotten01.jpg",
        "galleryPath": "images/peststotten",
        "galleryImages": ["peststotten01.jpg", "peststotten02.jpg", "peststotten03.jpg"],
        "tags": ["monument", "history", "plague", "Old Town"],
        "homepage": "",
        "secretLevel": "8",
        "latitude": 59.917290,
        "longitude": 10.746440,
        "favorite": true,
        "date": "2024-09-07"
    },
    {
        "id": 22,
        "title": "Stortorvets Gjestgiveri",
        "introduction": "Stortorvets Gjestgiveri is one of Oslo’s oldest and most charming restaurants, offering traditional Norwegian cuisine in a historic 17th-century setting in the heart of the city.",
        "description": "<p>Experience Stortorvets Gjestgiveri: A Taste of Oslo’s History</p><p>Located in a beautiful 17th-century building at Stortorvet square, Stortorvets Gjestgiveri is one of Oslo’s most iconic and historic dining establishments. Originally established in 1705, the restaurant has been serving guests for over 300 years, making it one of the city’s oldest continuously operating restaurants. Known for its cozy atmosphere, rich history, and traditional Norwegian dishes, Stortorvets Gjestgiveri offers a dining experience that transports you back in time.</p><p>A Historic Landmark: The building that houses Stortorvets Gjestgiveri is a historical treasure in itself. It features classic wooden architecture with traditional Norwegian decor, providing a warm and inviting ambiance that has been preserved through the centuries. The restaurant's walls are adorned with vintage paintings and historical artifacts, offering guests a glimpse into Oslo’s past while enjoying their meal.</p><p>Traditional Norwegian Cuisine: Stortorvets Gjestgiveri is renowned for its traditional Norwegian menu, featuring classic dishes such as reindeer stew, meatballs, and fresh seafood. The menu celebrates local ingredients and culinary heritage, providing a true taste of Norwegian cuisine. Whether you're stopping by for lunch, dinner, or a cozy evening drink, the restaurant offers a range of options to suit every taste.</p><p>A Favorite Among Locals and Visitors: Over the years, Stortorvets Gjestgiveri has been a popular meeting place for locals, artists, and visitors alike. Its central location and historic charm make it a favorite spot for those looking to enjoy a traditional meal in an authentic setting. The restaurant also offers a delightful outdoor seating area on the square, perfect for people-watching and soaking in the lively atmosphere of Oslo’s city center.</p><p>Events and Celebrations: Stortorvets Gjestgiveri is not only a place for everyday dining but also a popular venue for private events, celebrations, and holiday gatherings. Its historic rooms and intimate spaces provide a unique backdrop for any occasion, from business dinners to festive parties.</p><p>Getting There: Stortorvets Gjestgiveri is conveniently located in the heart of Oslo at Stortorvet square, near the Oslo Cathedral. It is easily accessible by foot from the city center, and public transportation options include trams and buses that stop directly at Stortorvet. The restaurant’s prime location makes it an ideal starting point for exploring Oslo’s other historical and cultural attractions.</p><p>Visitor Tips: Reservations are recommended, especially during weekends and peak dining hours. Be sure to explore the interior to fully appreciate the historical ambiance, and don’t miss the chance to try one of their signature Norwegian dishes. Stortorvets Gjestgiveri offers not just a meal, but a journey through Oslo’s rich culinary and cultural heritage, making it a must-visit for anyone exploring the city.</p>",
        "where": "Located at Stortorvet square in the heart of Oslo, offering a blend of traditional Norwegian cuisine and rich historical ambiance.",
        "address": "Grensen 1, 0159 Oslo",
        "category": ["restaurant"],
        "image": "images/stortorvetsgjestgiveri/stortorvetsgjestgiveri01.jpg",
        "galleryPath": "images/stortorvetsgjestgiveri",
        "galleryImages": ["stortorvetsgjestgiveri01.jpg", "stortorvetsgjestgiveri02.jpg", "stortorvetsgjestgiveri03.jpg", "stortorvetsgjestgiveri04.jpg", "stortorvetsgjestgiveri05.jpg"],
        "tags": ["restaurant", "historic", "Norwegian cuisine", "traditional"],
        "homepage": "https://www.stortorvetsgjestgiveri.no/",
        "secretLevel": "2",
        "latitude": 59.913373,
        "longitude": 10.744687,
        "favorite": true,
        "date": "2024-09-08"
    },
    {
        "id": 23,
        "title": "Dovrehallen",
        "introduction": "Dovrehallen is a traditional Norwegian restaurant and beer hall in Oslo, known for its cozy atmosphere, classic dishes, and welcoming ambiance that captures the essence of old Oslo.",
        "description": "<p>Experience Dovrehallen: A Classic Oslo Beer Hall with Traditional Flavors</p><p>Located in the heart of Oslo, Dovrehallen is a beloved establishment that has been serving traditional Norwegian food and drinks since 1867. With its warm and welcoming atmosphere, Dovrehallen offers a nostalgic journey into Oslo’s past, combining hearty meals with a classic beer hall setting that attracts both locals and visitors alike.</p><p>A Step Back in Time: Dovrehallen is set in a historic building with charming old-world decor that includes wooden furnishings, vintage signs, and classic touches that evoke the spirit of a bygone era. The interior is designed to make guests feel at home, offering a cozy retreat from the bustling city streets. Whether you’re here for a quick bite or a long, leisurely meal, Dovrehallen provides a comfortable setting to enjoy traditional Norwegian hospitality.</p><p>Traditional Norwegian Cuisine: The menu at Dovrehallen focuses on classic Norwegian dishes, including favorites like meatballs, reindeer stew, lutefisk, and fresh seafood. The restaurant prides itself on using quality local ingredients to create hearty, flavorful meals that reflect the best of Norway’s culinary traditions. Pair your meal with a selection of local beers or aquavit for a true Norwegian dining experience.</p><p>A Community Favorite: Over the years, Dovrehallen has maintained its status as a local favorite, known for its friendly service, relaxed vibe, and affordable prices. It’s a popular spot for lunch, dinner, or simply enjoying a drink with friends in a laid-back atmosphere. The beer hall aspect of Dovrehallen adds to its charm, making it a great place to socialize and experience a piece of Oslo’s social culture.</p><p>Live Music and Events: In addition to its food and drink offerings, Dovrehallen occasionally hosts live music and events, adding to the lively and convivial atmosphere. These events make it a great spot for those looking to enjoy some local entertainment while dining.</p><p>Getting There: Dovrehallen is centrally located at Storgata 22 in Oslo, within easy walking distance of public transportation hubs, including Oslo Central Station. It’s accessible by foot, tram, or bus, with multiple lines stopping nearby. The restaurant’s central location makes it a convenient stop during your exploration of Oslo’s attractions.</p><p>Visitor Tips: Dovrehallen is a popular spot, especially during peak dining hours, so consider making a reservation if you plan to visit during busy times. The menu offers something for everyone, but if you’re looking to try a traditional Norwegian dish, ask the staff for recommendations. Whether you’re dining solo, with friends, or as part of a group, Dovrehallen provides an authentic taste of Oslo’s culinary and cultural heritage that’s sure to leave a lasting impression.</p>",
        "where": "Located in central Oslo, offering a cozy beer hall atmosphere with traditional Norwegian dishes and a touch of old-world charm.",
        "address": "Storgata 22, 0184 Oslo",
        "category": ["restaurant"],
        "image": "images/dovrehallen/dovrehallen01.jpg",
        "galleryPath": "images/dovrehallen",
        "galleryImages": ["dovrehallen01.jpg", "dovrehallen02.jpg"],
        "tags": ["restaurant", "beer hall", "Norwegian cuisine", "traditional"],
        "homepage": "https://www.dovrehallen.no/",
        "secretLevel": "3",
        "latitude": 59.913846,
        "longitude": 10.751438,
        "favorite": true,
        "date": "2024-09-09"
    },
    {
        "id": 24,
        "title": "Haralds Vaffel",
        "introduction": "Haralds Vaffel is a quirky and beloved waffle stand in Oslo, known for serving delicious Norwegian waffles with creative toppings in a fun and friendly atmosphere. It all started with selling waffles out of the owners window at his appartment.",
        "description": "<p>Haralds Vaffel has quickly become a local legend in Oslo, turning the simple Norwegian waffle into an exciting culinary adventure. Located in the vibrant neighborhood of Grünerløkka, this charming waffle stand is famous for its inventive toppings, friendly vibe, and late-night hours that cater to both locals and tourists seeking a delicious snack.</p><p>Haralds Vaffel takes the traditional Norwegian waffle and adds a modern twist, offering toppings that range from classic jams and brown cheese to more unconventional options like pulled pork, Nutella, or even vegan alternatives. The result is a menu that caters to every taste, making each visit a new and delightful experience. The waffles are freshly made and served warm, perfect for a quick bite while exploring the city.</p><p>A Fun and Friendly Atmosphere: What sets Haralds Vaffel apart is not just the waffles, but the atmosphere. The stand's bright colors, fun signage, and welcoming staff create a laid-back environment that feels like a little slice of Oslo's vibrant food scene. Whether you're stopping by for breakfast, a midday snack, or a late-night treat, Haralds Vaffel offers a casual and enjoyable spot to indulge your sweet or savory cravings.</p><p>A Social Media Sensation: Haralds Vaffel has gained a strong following on social media, thanks to its photogenic waffles and playful branding. It's not uncommon to see people snapping pictures of their waffles before diving in, making it a popular stop for foodies and Instagram enthusiasts alike. Keep an eye out for their seasonal specials and limited-time toppings, which are often announced on their social media pages.</p><p>Getting There: Haralds Vaffel is located in Grünerløkka, a lively neighborhood known for its cafes, shops, and street art. It's easily accessible by tram, bus, or a pleasant walk from the city center. The stand is situated on Olaf Ryes plass, a popular square that's perfect for people-watching while you enjoy your waffle.</p><p>Visitor Tips: Be prepared for a queue, especially on weekends or during events, as Haralds Vaffel is a popular spot among both locals and tourists. The wait is well worth it, though, as the waffles are always freshly made and served with a smile. Try experimenting with different toppings or ask the staff for their recommendations. Whether you're looking for a quick snack or a unique taste of Oslo, Haralds Vaffel is a must-visit for anyone exploring the city.</p>",
        "where": "Located in the heart of Grünerløkka, offering delicious waffles with creative toppings in a lively and welcoming atmosphere.",
        "address": "Olaf Ryes plass, 0552 Oslo",
        "category": ["restaurant"],
        "image": "images/haraldsvaffel/haraldsvaffel01.jpg",
        "galleryPath": "images/haraldsvaffel",
        "galleryImages": ["haraldsvaffel01.jpg"],
        "tags": ["waffles", "street food", "Norwegian cuisine", "Grünerløkka"],
        "homepage": "https://www.haraldsvaffel.no/",
        "secretLevel": "3",
        "latitude": 59.923914,
        "longitude": 10.759362,
        "favorite": true,
        "date": "2024-09-10"
    },
    {
        "id": 25,
        "title": "SALT Art & Music",
        "introduction": "SALT is a unique cultural hub in Oslo, combining art, music, food, and saunas in a stunning waterside location, offering a vibrant and immersive experience for visitors.",
        "description": "<p>Discover SALT: Oslo’s Unique Art and Music Experience by the Fjord</p><p>Located on the Oslo waterfront, SALT Art & Music is a vibrant cultural village that blends art, music, food, and wellness in a one-of-a-kind setting. With its distinctive wooden structures and stunning views of the Oslofjord, SALT offers a dynamic space for both locals and tourists to explore diverse cultural experiences. From live concerts and art installations to steamy saunas and delicious street food, SALT is a must-visit destination that captures the creative spirit of Oslo.</p><p>An Immersive Cultural Space: SALT’s architecture is inspired by traditional Norwegian fish racks, and its wooden structures house a variety of activities and events. The site features several stages and venues for concerts, DJ sets, and performances, attracting artists from around the world. Art installations and exhibitions add to the creative atmosphere, making SALT a hub for contemporary art and cultural expression.</p><p>Saunas with a View: One of the highlights of SALT is its unique sauna experience. The site offers multiple saunas with stunning views of the Oslofjord, allowing visitors to relax and unwind in a serene setting. After a session in the sauna, guests can cool off in the fjord, creating a refreshing contrast that’s popular year-round. SALT’s saunas are open to the public, and they host special events such as sauna yoga, sound baths, and guided meditations.</p><p>Food, Drinks, and Socializing: SALT is also a great spot for enjoying food and drinks in a laid-back environment. The site features a variety of food trucks and bars offering a wide range of options, from Norwegian seafood to international street food favorites. Enjoy a meal with friends, grab a drink, and relax by the water while taking in the vibrant atmosphere of Oslo’s harbor.</p><p>A Year-Round Destination: SALT is open year-round, with different programming and events that change with the seasons. In the summer, it’s a lively spot for outdoor concerts and festivals, while the winter months bring cozy vibes with indoor events and warming saunas. SALT’s ever-changing lineup ensures there’s always something new and exciting to experience, making it a great place to visit multiple times throughout the year.</p><p>Getting There: SALT is conveniently located by the waterfront near Oslo’s Opera House, just a short walk from the city center. It’s easily accessible by foot, bike, or public transport, with nearby tram and bus stops. The scenic location by the fjord makes it an ideal stop along Oslo’s beautiful waterfront promenade.</p><p>Visitor Tips: Check SALT’s event calendar online for the latest information on concerts, sauna sessions, and other activities. It’s recommended to book sauna tickets in advance, especially on weekends and during special events, as they can sell out quickly. Dress comfortably and be ready to embrace the mix of culture, relaxation, and fun that SALT has to offer. Whether you’re looking to enjoy a live performance, relax in a sauna, or simply soak in the creative energy of Oslo, SALT is a destination like no other.</p>",
        "where": "Located by the Oslo waterfront, near the Opera House, offering a unique blend of art, music, saunas, and food with stunning views of the fjord.",
        "address": "Langkaia 1, 0150 Oslo",
        "category": ["cultural hub", "food"],
        "image": "images/salt/salt01.jpg",
        "galleryPath": "images/salt",
        "galleryImages": ["salt01.jpg", "salt02.jpg", "salt03.jpg"],
        "tags": ["art", "music", "sauna", "waterfront", "food"],
        "homepage": "https://salted.no/",
        "secretLevel": "1",
        "latitude": 59.906510,
        "longitude": 10.746471,
        "favorite": true,
        "date": "2024-09-11"
    },
    {
        "id": 26,
        "title": "The Viking Planet",
        "introduction": "The Viking Planet is an interactive museum in Oslo that offers a cutting-edge experience of Viking history through virtual reality, holograms, and immersive exhibits.",
        "description": "<p>Explore The Viking Planet: A High-Tech Journey into Viking History</p><p>The Viking Planet is Oslo's ultimate Viking experience, blending history with modern technology to bring the Viking Age to life. Located near the city center, this interactive museum offers a variety of state-of-the-art exhibits that allow visitors to step back in time and explore the world of the Vikings in a completely new way. From virtual reality adventures to holographic storytelling, The Viking Planet is a must-visit for anyone interested in Norway's rich Viking heritage.</p><p>A Modern Take on Viking History: The Viking Planet goes beyond traditional museum displays by using cutting-edge technology to create an immersive experience. Highlights include a 270-degree cinema that surrounds you with breathtaking visuals of Viking life, a virtual reality voyage on a Viking ship, and interactive screens that delve into the myths, legends, and daily life of the Vikings. It’s a hands-on way to explore history that’s fun and engaging for visitors of all ages.</p><p>Virtual Reality Adventures: One of the most popular features of The Viking Planet is its VR experience, where you can feel like a true Viking sailing the seas, battling enemies, or exploring ancient settlements. The VR headsets provide a stunningly realistic journey, making it feel like you’ve truly stepped into the Viking world. This interactive approach allows visitors to gain a deeper understanding of Viking culture in an entertaining and memorable way.</p><p>Educational and Entertaining: The Viking Planet is designed to be both educational and entertaining, making it a great choice for families, school groups, and history enthusiasts. The exhibits are available in multiple languages, ensuring that everyone can enjoy and learn from the experience. The museum also offers detailed information on Viking artifacts, navigation techniques, and the impact of Viking explorations across Europe.</p><p>Location and Accessibility: Conveniently located near Oslo’s City Hall and the Aker Brygge area, The Viking Planet is easily accessible by foot, tram, or bus. Its central location makes it a perfect addition to any day of sightseeing in Oslo, especially for those interested in exploring the city’s historical attractions.</p><p>Visitor Tips: Plan to spend at least an hour exploring the different exhibits, and be sure to try the virtual reality experiences for an unforgettable journey into Viking history. Check their website for ticket information, opening hours, and special events that may be happening during your visit. Whether you’re a history buff or just curious about the Viking Age, The Viking Planet offers a unique and interactive way to connect with Norway’s storied past.</p>",
        "where": "Located near Oslo’s City Hall, offering an immersive and interactive experience of Viking history through cutting-edge technology.",
        "address": "Fridtjof Nansens plass 4, 0160 Oslo",
        "category": ["museum"],
        "image": "images/vikingplanet/vikingplanet01.jpg",
        "galleryPath": "images/vikingplanet",
        "galleryImages": ["vikingplanet01.jpg", "vikingplanet02.jpg", "vikingplanet03.jpg", "vikingplanet04.jpg", "vikingplanet05.jpg"],
        "tags": ["museum", "Viking history", "virtual reality", "interactive"],
        "homepage": "https://thevikingplanet.com/",
        "secretLevel": "3",
        "latitude": 59.913245,
        "longitude": 10.734185,
        "favorite": true,
        "date": "2024-09-12"
    },
    {
        "id": 27,
        "title": "Marmælen på Honnørbrygga",
        "introduction": "Marmælen is a striking public art installation at Honnørbrygga in Oslo, blending contemporary art with maritime heritage in a prime waterfront location near Oslo’s City Hall.",
        "description": "<p>Discover Marmælen: A Unique Art Installation on Oslo’s Waterfront</p><p>Located at Honnørbrygga, near Oslo’s City Hall, Marmælen is a captivating sculpture that adds a touch of modern art to the city’s vibrant waterfront area. Created by artist Jone Kvie, Marmælen is inspired by the shapes of natural stones and marine life, symbolizing the deep connection between Oslo and the sea. This installation is a must-see for art lovers and those exploring Oslo’s harbor, offering a unique visual experience that reflects the city’s maritime heritage.</p><p>An Artistic Tribute to the Sea: Marmælen consists of a large, abstract stone structure that resembles a boulder or a marine creature emerging from the sea. The artwork’s surface features textures and patterns reminiscent of natural stone formations, evoking thoughts of both ancient landscapes and the constant movement of water. The sculpture’s placement by the water’s edge enhances its connection to the sea, making it a seamless addition to Oslo’s picturesque harbor.</p><p>A Perfect Spot for Reflection: Honnørbrygga, where Marmælen is located, is a popular spot for both locals and tourists to relax and take in the views of the Oslofjord. The installation provides a tranquil setting for contemplation, allowing visitors to enjoy the gentle lapping of the waves and the serene surroundings. The sculpture’s smooth, organic forms invite interaction, making it a great place to sit, reflect, or simply appreciate the blend of art and nature.</p><p>A Celebration of Oslo’s Harbor: As part of the city’s effort to revitalize the waterfront area, Marmælen contributes to the artistic and cultural landscape of Oslo’s harbor. It is one of several public art pieces that enhance the aesthetic appeal of the area, encouraging people to engage with their surroundings in new and creative ways. The sculpture also serves as a reminder of Oslo’s historical connection to the sea, celebrating the city’s rich maritime traditions.</p><p>Getting There: Marmælen is located at Honnørbrygga, just a short walk from Oslo’s City Hall and Aker Brygge. It is easily accessible by foot, bike, or public transportation, with nearby tram, bus, and ferry stops. The sculpture’s central location makes it an ideal stop on any waterfront stroll, providing a peaceful retreat amid the bustling cityscape.</p><p>Visitor Tips: Visit Marmælen during different times of the day to see how the changing light and tides interact with the sculpture’s textures and forms. The waterfront area is a great place to take photographs, enjoy a picnic, or simply relax by the water. Be sure to explore other nearby attractions, such as the Nobel Peace Center and the Aker Brygge district, to make the most of your visit to Oslo’s lively harbor.</p>",
        "where": "Located at Honnørbrygga near Oslo’s City Hall, offering a striking blend of contemporary art and maritime heritage on the city’s bustling waterfront.",
        "address": "Honnørbrygga, 0160 Oslo",
        "category": ["public art", "statue"],
        "image": "images/marmaelen/marmaelen01.jpg",
        "galleryPath": "images/marmaelen",
        "galleryImages": ["marmaelen01.jpg"],
        "tags": ["public art", "sculpture", "waterfront", "contemporary art"],
        "homepage": "",
        "secretLevel": "10",
        "latitude": 59.911167,
        "longitude": 10.731611,
        "favorite": true,
        "date": "2024-09-13"
    },
    {
        "id": 28,
        "title": "Popsenteret",
        "introduction": "Popsenteret is an interactive museum in Oslo dedicated to Norwegian popular music, offering a fun and engaging journey through the history and evolution of pop music in Norway.",
        "description": "<p>Explore Popsenteret: Oslo’s Interactive Music Museum</p><p>Located in the vibrant Grünerløkka district, Popsenteret is a one-of-a-kind museum that celebrates the rich history of Norwegian popular music. From the early days of rock and roll to the latest chart-topping hits, Popsenteret offers an interactive and immersive experience that allows visitors to dive deep into Norway’s musical heritage. Whether you’re a music enthusiast or simply curious about the sounds that have shaped the nation, Popsenteret is a must-visit destination for all ages.</p><p>Interactive Exhibits and Hands-On Fun: Popsenteret stands out for its interactive approach to exploring music history. Visitors can create their own tracks in the recording studio, design album covers, and even step into a mock stage to perform their favorite songs. The museum features a vast collection of memorabilia, photographs, and recordings that trace the evolution of Norwegian pop music, from iconic artists to emerging talents. Touchscreens, soundscapes, and interactive displays make learning about music both educational and entertaining.</p><p>Journey Through Decades of Music: The museum is divided into different sections that cover various eras of Norwegian music, showcasing everything from the rock bands of the 1960s to contemporary pop stars. Multimedia exhibits highlight key moments, influential artists, and the cultural impact of Norwegian music on the global stage. Popsenteret also delves into the stories behind the songs, offering insights into the creative processes and societal influences that have shaped Norway’s musical landscape.</p><p>A Family-Friendly Destination: Popsenteret is designed to be engaging for visitors of all ages. Families, school groups, and music lovers alike will find plenty to enjoy, with activities that cater to both kids and adults. The museum frequently hosts workshops, concerts, and special events that add an extra layer of excitement to the visit, making it a dynamic and lively place to explore.</p><p>Location and Accessibility: Popsenteret is conveniently located in Grünerløkka, one of Oslo’s trendiest neighborhoods known for its cafes, shops, and street art. It’s easily accessible by tram, bus, or a pleasant walk from the city center. The museum’s location makes it an ideal stop as part of a broader exploration of the area’s creative and cultural offerings.</p><p>Visitor Tips: Allow yourself plenty of time to explore the interactive exhibits and try out the various activities. Check Popsenteret’s event calendar online for information on upcoming concerts, workshops, and temporary exhibitions. Whether you’re creating your own hit song, learning about Norway’s pop legends, or just enjoying a fun day out, Popsenteret offers a memorable and engaging experience that’s sure to strike a chord.</p>",
        "where": "Located in the trendy Grünerløkka district of Oslo, offering an engaging and interactive exploration of Norwegian pop music history.",
        "address": "Trondheimsveien 2, 0560 Oslo",
        "category": ["museum", "music"],
        "image": "images/popsenteret/popsenteret01.jpg",
        "galleryPath": "images/popsenteret",
        "galleryImages": ["popsenteret01.jpg"],
        "tags": ["museum", "music", "interactive", "pop culture"],
        "homepage": "https://www.popsenteret.no/",
        "secretLevel": "3",
        "latitude": 59.919884,
        "longitude": 10.760829,
        "favorite": true,
        "date": "2024-09-14"
    },
    {
        "id": 29,
        "title": "Oslo's Geographical Midpoint",
        "introduction": "You might think that Oslo's Geographical Midpoint is somewhere downtown in the city. Well, think again! It is located in the forested area of Nordmarka, marking the exact center of the city’s boundaries and offering a tranquil escape into nature.",
        "description": "<p>Tucked away in the lush forests of Nordmarka, Oslo's Geographical Midpoint is a little-known but intriguing spot that marks the exact center of the city’s boundaries. This hidden gem provides a perfect blend of nature and geography, offering a unique destination for hikers, nature lovers, and those seeking a peaceful retreat away from the urban hustle. Visiting the midpoint is a great way to explore Oslo's expansive green spaces while enjoying the novelty of standing at the city’s center point.</p><p>A Tranquil Spot in the Heart of Nature: The midpoint is located deep within Nordmarka, one of Oslo’s most popular recreational areas known for its extensive network of hiking and biking trails, lakes, and scenic views. Surrounded by tall trees and the sounds of nature, the site offers a quiet and serene atmosphere that feels worlds away from the bustling city. It’s an ideal spot for a picnic, a rest during a hike, or simply to enjoy the tranquility of the forest.</p><p>A Fun Fact for Outdoor Enthusiasts: Marked with a simple stone or a plaque, Oslo’s Geographical Midpoint is a fun and quirky landmark that appeals to geography buffs and outdoor enthusiasts alike. It’s not a heavily advertised or commercialized site, which adds to its charm as a hidden treasure for those who seek it out. Finding the midpoint can be an adventure in itself, as it involves navigating through the forest trails of Nordmarka.</p><p>Getting There: To visit Oslo's Geographical Midpoint, you’ll need to venture into Nordmarka, which is accessible by public transportation and is a popular area for outdoor activities. The closest entry point is usually from Frognerseteren or Sognsvann, both of which can be reached by the Oslo Metro (T-bane). From there, a hike through the forest will lead you to the midpoint, so be sure to bring a map or GPS for guidance. The journey through Nordmarka’s scenic landscape is part of the experience, offering beautiful views and the opportunity to connect with nature.</p><p>Visitor Tips: Wear comfortable hiking shoes and bring water and snacks, as the hike to the midpoint can take some time depending on your starting point. The area is best explored during daylight hours, and it’s advisable to check the weather forecast before heading out. While there are no facilities at the site, the surrounding forest provides plenty of opportunities for outdoor enjoyment. Whether you’re a local looking for a new adventure or a visitor eager to explore Oslo’s natural side, the Geographical Midpoint offers a rewarding and off-the-beaten-path experience.</p>",
        "where": "Located in the forested area of Nordmarka, marking the exact geographical center of Oslo’s city boundaries.",
        "address": "Nordmarka, Oslo",
        "category": ["landmark", "monument"],
        "image": "images/geographicalmidpoint/geographicalmidpoint01.jpg",
        "galleryPath": "images/geographicalmidpoint",
        "galleryImages": ["geographicalmidpoint01.jpg"],
        "tags": ["landmark", "nature", "hiking", "outdoors"],
        "homepage": "",
        "secretLevel": "9",
        "latitude": 60.023611,
        "longitude": 10.744444,
        "favorite": true,
        "date": "2024-09-15"
    },
    {
        "id": 30,
        "title": "Teddy's Soft Bar",
        "introduction": "Teddy's Soft Bar is a beloved retro diner in Oslo, offering a nostalgic experience with its vintage decor, classic American-style menu, and warm, welcoming atmosphere.",
        "description": "<p>Located in the heart of Oslo, Teddy's Soft Bar is a charming and authentic 1950s-style diner that has been a staple of the city since 1958. With its red leather booths, vintage jukebox, and black-and-white checkered floors, Teddy's Soft Bar offers a delightful throwback to the golden age of diners. This quirky and cozy spot is perfect for anyone looking to enjoy a nostalgic meal in a friendly and relaxed atmosphere.</p><p>Classic American-Style Menu: The menu at Teddy's Soft Bar features a variety of classic diner fare, including burgers, hot dogs, milkshakes, and all-day breakfast options. Whether you're craving a hearty burger with fries, a comforting milkshake in one of their vintage glass cups, or a traditional diner breakfast, Teddy's offers a taste of Americana right in the center of Oslo. The diner is also known for its friendly service and generous portions, making it a favorite among both locals and tourists.</p><p>A Nostalgic Atmosphere: What sets Teddy's Soft Bar apart is its dedication to preserving the look and feel of a classic 1950s diner. The walls are adorned with vintage memorabilia, and the retro jukebox plays hits from the past, creating an ambiance that transports guests back in time. It’s a great spot to relax, enjoy a meal, and soak in the nostalgic vibe that has made Teddy's a beloved Oslo institution for decades.</p><p>A Local Favorite: Over the years, Teddy's Soft Bar has become a popular meeting place for all generations, attracting everyone from nostalgic locals who remember the diner’s early days to curious visitors eager to experience a piece of Oslo’s history. Its unpretentious charm and classic decor make it a unique and enduring part of the city’s dining scene.</p><p>Getting There: Teddy's Soft Bar is conveniently located on Brugata in central Oslo, within easy walking distance from Oslo Central Station and several tram and bus stops. Its central location makes it an ideal stop for a casual meal or a coffee break while exploring the city.</p><p>Visitor Tips: Teddy's Soft Bar can get busy, especially during lunch hours and weekends, so be prepared for a potential wait. The diner is cash-only, so make sure to bring cash for your visit. Whether you’re stopping by for a quick bite or looking to experience Oslo’s retro side, Teddy's Soft Bar offers a charming and memorable dining experience that’s worth the visit.</p>",
        "where": "Located on Brugata in central Oslo, offering a nostalgic diner experience with classic American-style food and vintage decor.",
        "address": "Brugata 3A, 0186 Oslo",
        "category": ["restaurant", "diner", "pub"],
        "image": "images/teddyssoftbar/teddyssoftbar01.jpg",
        "galleryPath": "images/teddyssoftbar",
        "galleryImages": ["teddyssoftbar01.jpg"],
        "tags": ["diner", "retro", "American cuisine", "nostalgia"],
        "homepage": "",
        "secretLevel": "5",
        "latitude": 59.914305,
        "longitude": 10.754165,
        "favorite": true,
        "date": "2024-09-16"
    },
    {
        "id": 31,
        "title": "Råkk og Rålls Brukthandel",
        "introduction": "Råkk og Rålls Brukthandel is a popular second-hand store in Oslo, offering a treasure trove of records, DVD, and tapes, perfect for those seeking unique finds.",
        "description": "<p>Råkk og Rålls Brukthandel is a beloved second-hand store that has been a go-to spot for record lovers and movie hunters in Oslo. This shop offers a nostalgic journey through decades of style and culture. Whether you’re looking for a unique DVD, rare vinyl, or a one-of-a-kind item for your collection, Råkk og Rålls Brukthandel is the place to find it.</p><p>Step inside Råkk og Rålls, and you’ll be greeted by racks filled with vinyl records, and displays of retro memorabilia. The store’s laid-back atmosphere and friendly staff make it easy to spend time browsing through its diverse offerings.</p><p>One of the standout features of Råkk og Rålls Brukthandel is its impressive selection of vinyl records. Music enthusiasts can dig through crates of LPs spanning various genres, including rock, metal, punk, jazz, and more. Whether you’re a seasoned collector or a casual listener, the store’s vinyl section offers something for everyone, with both rare finds and popular classics.</p><p>Råkk og Rålls Brukthandel is easily accessible by foot from the city center or by public transport, with nearby tram and bus stops.</p><p>Visitor Tips: Be prepared to spend some time exploring the store’s many nooks and crannies, as you never know what hidden gems you might find. Prices can be stiff, and the staff is always willing to help you dig up that special item. Whether you’re looking to add to your vinyl or movie collection, Råkk og Rålls Brukthandel offers a delightful escape into the world of retro and reuse.</p>",
        "where": "Located in the Grønland district of Oslo, offering a wide selection of vintage clothing, records, and quirky collectibles in a fun and friendly atmosphere.",
        "address": "Stortingsgata 8, 0161 Oslo",
        "category": ["store", "vintage"],
        "image": "images/raakkoogrolls/raakkoogrolls01.jpg",
        "galleryPath": "images/raakkoogrolls",
        "galleryImages": ["raakkoogrolls01.jpg", "raakkoogrolls02.jpg", "raakkoogrolls03.jpg", "raakkoogrolls04.jpg", "raakkoogrolls05.jpg", "raakkoogrolls06.jpg", "raakkoogrolls07.jpg", "raakkoogrolls08.jpg", "raakkoogrolls09.jpg", "raakkoogrolls10.jpg", "raakkoogrolls11.jpg", "raakkoogrolls12.jpg", "raakkoogrolls13.jpg", "raakkoogrolls14.jpg"],
        "tags": ["vintage", "second-hand", "records", "collectibles"],
        "homepage": "",
        "secretLevel": "4",
        "latitude": 59.913140,
        "longitude": 10.737643,
        "favorite": true,
        "date": "2024-09-17"
    },
    {
        "id": 33,
        "title": "Svenskemuren",
        "introduction": "Svenskemuren is a historical series of stone walls in Oslo, built by Swedish prisoners of war during the 1808-1809 war between Norway and Sweden, offering a glimpse into the past and the turbulent history between the two nations.",
        "description": "<p>Svenskemuren, or the Swedish Wall, refers to a series of stone walls in Oslo that were constructed by Swedish prisoners of war during the conflict between Norway and Sweden in 1808-1809. These walls are a testament to Norway’s military success in the Napoleonic Wars and stand as a poignant reminder of the hardships endured by the Swedish prisoners who were forced into labor while waiting for peace. The construction of these walls served both practical and symbolic purposes, reflecting the complex history and strained relations between Norway and Sweden during this period.</p><p>Historical Background: During the 1808-1809 war, Norway achieved significant victories against Swedish forces. Following the battles, such as the notable victories at Prestebakke and Trangen, Norway captured nearly 1,000 Swedish soldiers. These prisoners were not sent back to Sweden, as they could rejoin the conflict, but were instead kept in makeshift camps around Christiania (now Oslo). Due to Norway’s strained economy, exacerbated by ongoing conflict and British blockades, the Swedish prisoners were used as forced labor to reduce the financial burden of their upkeep.</p><p>Building the Walls: The Swedish prisoners were tasked with constructing various stone walls, known as Svenskemurer, throughout Oslo and its surroundings. These walls were often used to mark property boundaries or as fortifications. One prominent example is the 2.5-kilometer wall near Nordberg gård, which served as a boundary between the Brekke and Nordberg farms. The prisoners worked under harsh conditions, often with little regard for their safety, and the use of Swedish labor was preferred due to its lower cost compared to hiring Norwegian workers.</p><p>The Wall at Solli Plass: Another notable Svenskemur can be found near Solli Plass in Oslo. This wall once marked the boundary of the Petersborg estate along Drammensveien and was constructed under the direction of Jacob Nielsen, a prominent merchant and knight who inherited the property in 1808. While the original wall extended much further, only about 90 meters remain today. For those interested in Oslo’s history, a small plaque on the wall provides context and highlights its significance as a Svenskemur.</p><p>Exploring the Legacy: Svenskemuren is not just a singular site but a collection of historical remnants scattered throughout Oslo. Many of these walls are hidden or partially covered by nature, waiting to be rediscovered. The legacy of the Swedish prisoners extends beyond Oslo, as they were also sent to work in other regions, including Bærums Verk and Drammen, contributing to infrastructure projects and even farm work under harsh conditions.</p><p>Getting There: Svenskemuren can be explored in various locations, including Nordberg, Ekeberg, and Solli Plass. Public transport options such as trams and buses can take you close to these sites, with walking trails available for those who wish to explore further. The walls offer a unique historical walk combined with the opportunity to enjoy Oslo’s natural scenery.</p><p>Visitor Tips: As many Svenskemurer are located in natural settings or integrated into the cityscape, it’s advisable to wear comfortable walking shoes. Take time to read any informational plaques and reflect on the history these walls represent. Svenskemuren offers a quiet, contemplative journey through Oslo’s military past and the enduring legacy of those who built them under duress.</p>",
        "where": "Located in various spots throughout Oslo, including Nordberg and Solli Plass, these stone walls serve as historical markers of Norway’s past conflicts with Sweden.",
        "address": "Various locations, Oslo",
        "category": ["historical site", "landmark", "war"],
        "image": "images/svenskemuren/svenskemuren01.jpg",
        "galleryPath": "images/svenskemuren",
        "galleryImages": ["svenskemuren01.jpg"],
        "tags": ["historical site", "landmark", "military history", "Napoleonic Wars"],
        "homepage": "",
        "secretLevel": "3",
        "latitude": 59.973652,
        "longitude": 10.753033,
        "favorite": true,
        "date": "2024-09-17"
    },
    {
        "id": 34,
        "title": "Roseslottet",
        "introduction": "Roseslottet is a powerful and moving outdoor art installation in Oslo, commemorating Norway’s fight for freedom during World War II and celebrating the resilience of the human spirit.",
        "description": "<p>Perched on a hill near Frognerseteren in Oslo, Roseslottet is a breathtaking art installation that honors Norway’s struggle for freedom during the dark years of World War II. Created by artist brothers Vebjørn and Eimund Sand, Roseslottet is more than just a memorial—it’s an immersive experience that blends art, history, and nature to tell the story of resistance, hope, and human dignity. This open-air installation serves as a reminder of the values of democracy and freedom, making it a poignant destination for both locals and visitors.</p><p>A Symbolic Art Installation: Roseslottet features a series of monumental structures, sculptures, and symbolic roses that represent the Norwegian spirit during the Nazi occupation from 1940 to 1945. The artwork is set against the stunning backdrop of Oslo’s natural landscape, with the installations illuminated at night, creating a striking visual effect. Central to the installation are the five golden pillars that represent the five years of occupation, each standing as a testament to the courage and resilience of the Norwegian people.</p><p>A Journey Through History: As visitors walk through Roseslottet, they are taken on a journey through Norway’s wartime history. The installation includes powerful imagery, detailed artworks, and historical information that reflect the country’s resistance efforts, the plight of those who suffered, and the ultimate victory of freedom over oppression. The artwork also highlights the importance of human rights and the enduring values of democracy, making it a thought-provoking and educational experience.</p><p>Art and Nature in Harmony: Located in the scenic surroundings of Frognerseteren, Roseslottet offers visitors a chance to connect with nature while reflecting on a pivotal chapter in Norwegian history. The installation’s elevated position provides panoramic views of Oslo and the fjord, adding to the sense of peace and contemplation that the site inspires. Whether visited during the day or lit up at night, Roseslottet is a moving and unforgettable experience.</p><p>Getting There: Roseslottet is accessible by public transport, with the nearest metro station being Frognerseteren, which is served by line 1. From the station, it’s a short walk to the installation site. For those driving, parking is available nearby. The area is also popular for hiking, and visiting Roseslottet can be combined with exploring the beautiful trails of Nordmarka.</p><p>Visitor Tips: Plan to spend at least an hour exploring the installation and taking in the detailed artworks. Dress warmly, especially if visiting in the evening or during the winter months, as the site is exposed to the elements. Roseslottet is open year-round, and the experience changes with the seasons, offering something unique at every visit. Be sure to check their official website for current opening hours, ticket information, and special events. Whether you’re interested in history, art, or simply looking for a place of reflection, Roseslottet is a powerful tribute to the enduring human spirit and a must-visit landmark in Oslo.</p>",
        "where": "Located near Frognerseteren in Oslo, Roseslottet offers a powerful artistic tribute to Norway’s wartime history amidst beautiful natural surroundings.",
        "address": "Frognerseteren, 0791 Oslo",
        "category": ["art installation", "historical site"],
        "image": "images/roseslottet/roseslottet01.jpg",
        "galleryPath": "images/roseslottet",
        "galleryImages": ["roseslottet01.jpg"],
        "tags": ["art", "history", "World War II", "freedom"],
        "homepage": "https://roseslottet.no/",
        "latitude": 59.979400,
        "longitude": 10.676033,
        "favorite": true,
        "date": "2024-09-17"
    }
]